[
    {
        "category":"business",
        "titles":"Rupee eyes speculative flows after defeat at key resistance level",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Indian rupee is expected to open little changed on Tuesday, taking direction from speculative and other flows after failing to pierce past an important handle in previous sessions. Goldman Sachs last week said it is moving its forecast of the Fed's first rate cut back one meeting, from July to September.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/rupee-eyes-speculative-flows-after-defeat-at-key-resistance-level890530?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Our govt focuses on transparency, UPA hid deficits: FM Sitharaman",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Finance Minister Nirmala Sitharaman took to X on Monday to criticise the previous Congress-led UPA government's budgetary practices. \"Our government has prioritized transparency in its budgeting practices and numbers. This starkly contrasts the Congress-led UPA government's repetitive practice of hiding the deficits through off-budget borrowings and issuance of 'Oil Bonds',\" she said.",
        "urls":"https:\/\/x.com\/nsitharaman\/status\/1794976075065540611?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Asia shares drift after rally, Wall Street reopen in focus",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Asian shares held a mixed tone on Tuesday after rallying the previous session, as rising bets of an imminent European rate cut helped risk appetite ahead of some key inflation data. MSCI's broadest index of Asia-Pacific shares outside Japan rose 0.4%, thanks to a 0.7% gain in Hong Kong's Hang Seng index, after gaining 0.9% on Monday.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/asia-shares-drift-after-rally-wall-street-reopen-in-focus202650?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"68% insolvency & bankruptcy claims lost with no interest: Kotak",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Billionaire Uday Kotak said 68% of the claims made under the government's Insolvency and Bankruptcy Code (IBC) are \"lost with no interest post claim admission\". \"Main reason is delay in admission to NCLT and time taken there,\" Kotak said on the loss of claims. \"If we quicken that, recovery percentage improves. ICB has brought benefits of...corporate accountability,\" he added.",
        "urls":"https:\/\/x.com\/udaykotak\/status\/1795281309092491656?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Book profit on election-driven market rallies",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Given the current valuation, any market upswing due to the election outcome must be taken as an opportunity for investors to book profit, according to Quest Investment Advisors' Aniruddha Sarkar. Sarkar currently maintains around 8-10% in cash, though he is not very negative on the market.",
        "urls":"https:\/\/www.ndtvprofit.com\/markets\/book-profit-on-election-driven-market-rallies-says-quest-investments-aniruddha-sarka?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Indian shares likely to open slightly higher tracking Asian peers",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Indian shares are set to open marginally higher on Tuesday, tracking Asian peers, while investor focus will be on the country's biggest insurer, Life Insurance Corp of India (LIC), after its quarterly earnings. The Gift Nifty was trading at 23,022 points as of 7:29 am IST, indicating that the Nifty 50 will open higher than its previous close of 22,932.45.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/indian-shares-likely-to-open-slightly-higher-tracking-asian-peers811486?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Defence, railway stocks to rise if BJP wins polls: Motilal Oswal",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Motilal Oswal Financial Services Chairman Raamdeo Agrawal said there is a high probability that ruling BJP government will continue to be in power after the ongoing Lok Sabha elections. He added the shares of defence, infrastructure, railway and capital goods companies will be boosted in that case. \"These were areas where the government has focussed on, invested money,\" he added.",
        "urls":"https:\/\/www.hindustantimes.com\/business\/motilal-oswals-chief-predicts-these-stocks-will-gain-if-pm-narendra-modi-reelected-101716862171762-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"How to stop spam messages in Android",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Learn how to stop spam messages in Android with just five simple steps. By enabling spam protection and blocking suspicious senders in Google Messages, you can effectively safeguard your inbox and enjoy a clutter-free messaging experience. Take control of your digital communication today and put an end to unwanted spam texts disrupting your day.",
        "urls":"https:\/\/trak.in\/stories\/how-to-stop-spam-messages-in-android-5-easy-steps\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"UK will issue 45,000 new seasonal work visas for 5 years",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"To aid strategic planning and reduce reliance on migrant labor, the UK has extended the Seasonal Worker visa program until 2029. This extension, along with a 50 million pound investment in automation and robotic development, aims to alleviate labor shortages in the food supply chain. The government will issue 45,000 visas annually and support technological advancements in agriculture.",
        "urls":"https:\/\/trak.in\/stories\/uk-seasonal-work-visa-extended-for-5-years-for-these-skills\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Google invests ₹2900 crore in Flipkart, without a board seat",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Google has invested $350 million in Flipkart, valuing the e-commerce company at $36 billion, without securing a board seat. The investment aims to modernize Flipkart's digital infrastructure through a cloud collaboration. Flipkart is preparing for an IPO, expanding same-day delivery to 20 cities, and addressing financial challenges.",
        "urls":"https:\/\/trak.in\/stories\/google-invests-rs-2900-crore-into-flipkart-but-wont-get-a-board-seat\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"My wife doesn't want me to enter politics: Former RBI Guv Rajan",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Commenting on speculations that he will join Congress and stand in elections, former RBI Governor Raghuram Rajan said he is an academic. \"I have a family and a wife who don't want me to enter politics,\" he said during an interview. Speaking on the criticism he faces, Rajan said, \"My wife says 'What are you getting out of all this?'.\"",
        "urls":"https:\/\/www.youtube.com\/watch?t=2138s&utm_campaign=fullarticle&v=K_w5eT9JpBU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"LIC shares still very undervalued: Chairman Siddhartha Mohanty",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"LIC Chairman Siddhartha Mohanty said shares of his company are still \"very undervalued\".  LIC shares had debuted on stock markets two years ago at ₹867 and are currently trading at ₹1,021, marking an increase of around 17.76%. Mohanty said he believes stock price of LIC will go higher given the company's improving financial performance.",
        "urls":"https:\/\/www.cnbctv18.com\/market\/lic-share-price-stock-undervalued-says-chairman-will-go-up-further-q4-dividend-19418819.htm\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Madhav Infra receives an order from NTPC-SAIL Power company",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Madhav Infra Projects hit 2% upper circuit upon receiving a work order worth ₹90.34 crores from NTPC-SAIL Power Company Limited for the design, engineering, procurement, construction, installation, commissioning, operation and maintenance of 15 MW Floating Solar PV Project at Maroda Reservoir-I, Of NSPCL in Bhilai, Chhattisgarh.",
        "urls":"https:\/\/tradebrains.in\/features\/penny-stock-hits-upper-circuit-after-it-receives-an-order-worth-90-34-cr-from-ntpc-sail-power-company\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"India's FII selloff worst among emerging markets in May",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India recorded the highest foreign fund outflows among emerging markets in May as foreign institutional investors (FIIs) pulled out $2.97 billion from the Indian market so far this month. \"Elections are not the only factor influencing FIIs to sell in Indian markets...Elevated market valuations and profit-taking after a strong rally also play a role,\" said Sunil Damania, CIO of MojoPMS.",
        "urls":"https:\/\/www.ndtvprofit.com\/markets\/india-records-worst-fii-selloff-among-emerging-markets-in-may?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Jubilant Industries net profit increased by 195% YoY",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Jubilant Industries share hits 5% upper circuit at ₹1,111.10 after reporting a net profit surge of 195% QoQ and 16% YoY in Q4FY24. Revenue rose 3% QoQ to ₹300 Cr but fell 13% YoY. The net profit improved from a ₹23 Cr loss to a ₹22 Cr profit QoQ. Jubilant operates in two segments, mainly agri products and performance polymers.",
        "urls":"https:\/\/tradebrains.in\/features\/chemical-stock-hits-5-upper-circuit-after-companys-net-profit-increased-by-195-yoy\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Stocks that can benefit from data centre boom in India",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India generates about 20% of the global data, but in terms of data centre capacity, its share globally is just 3%. The country's under-penetration in the sector and several demand catalysts indicate potential for large capacity-addition plans over the next few years, according to CareEdge Ratings.",
        "urls":"https:\/\/www.ndtvprofit.com\/buzzing-stocks\/from-anant-raj-to-airtel-stocks-that-can-benefit-from-data-centre-boom-in-india?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Anlon Technology receives order from Airports Authority of India",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Anlon Technology Limited specializing in providing end-to-end engineering services tailored for aviation infrastructure jumped 9% in the day’s trade upon receiving a work order worth ₹22.68 crore from the Airports Authority of India for the Supply, Installation, Testing, and Commissioning of Trackjet make Runway Rubber Removal Machine.",
        "urls":"https:\/\/tradebrains.in\/features\/stock-jumps-9-after-company-received-work-order-worth-22-68-cr-from-airports-authority-of-india\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"NIBE net profit increased by 137% QoQ",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"NIBE Ltd shares hit a 5% upper circuit at ₹1,575.60. This bullish movement followed the announcement of strong financial results for Q4FY24, with revenue increasing by 142% QoQ to ₹152.17 crores and net profits rising by 137% to ₹10.43 crores. YoY, net sales surged by 143%, turning a net loss into a profit.",
        "urls":"https:\/\/tradebrains.in\/features\/defence-stock-hits-5-upper-circuit-after-companys-net-profit-increased-by-137-qoq\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"India records worst FII selloff among emerging markets in May",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India recorded the highest foreign fund outflows in May among emerging markets as election uncertainty created panic in Dalal Street. Overseas investors have been selling domestic equities since the start of the month on fears of the uncertain election verdict due to the less-than-expected voter turnout in the Lok Sabha elections.",
        "urls":"https:\/\/www.ndtvprofit.com\/markets\/india-records-worst-fii-selloff-among-emerging-markets-in-may?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"LIC eyes health insurance foray via organic, inorganic routes",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Life Insurance Corp. aims to take advantage of the underpenetrated health insurance space and is prepared to explore both organic and inorganic routes for the segment, Chairperson Siddhartha Mohanty said on Tuesday. There is a huge scope in the health insurance space as the coverage out of the total health expenditure is very less, Mohanty told NDTV Profit.",
        "urls":"https:\/\/www.ndtvprofit.com\/markets\/lic-to-foray-into-health-insurance-via-organic-inorganic-routes-chairman-siddhartha-mohanty?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Pakistan to revive China belt and road initiative projects",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Pakistan's new government is hoping to inject some fresh momentum into projects that fall under China's Belt and Road Initiative, as it tries to boost the country's troubled economy. The South Asian nation is looking at joint ventures for renewable energy projects, agriculture collaboration and possibly enticing some Chinese companies to relocate to Pakistan.",
        "urls":"https:\/\/www.ndtvprofit.com\/world\/pakistan-to-revive-china-belt-and-road-initiative-projects?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Work from home ends for HSBC, Citigroup staff in US",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"A shift to full-time office work is being implemented by Citigroup Inc. and HSBC Holdings Plc, moving away from hybrid work rules. This change precedes the Financial Industry Regulatory Authority's (FINRA) update to workplace monitoring guidelines. The modification impacts 600 Citigroup employees and around 350 HSBC workers.",
        "urls":"https:\/\/trak.in\/stories\/citigroup-hsbc-bank-order-employees-to-work-from-office-in-us\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Godrej & Boyce sells 2 Mumbai offices to Godrej for ₹157cr: Report",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Godrej & Boyce has sold two office spaces in Mumbai's Vikhroli to Godrej Industries for ₹157 crore, Moneycontrol reported citing documents accessed by Propstack. The two spaces are located in the posh Godrej One tower and sprawl approximately 24,000 square feet each. The two offices also feature a total of 75 parking spaces in the building's upper and lower basements.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/business\/real-estate\/godrej-boyce-sells-two-office-spaces-in-mumbai-to-godrej-industries-for-rs-157-crore-12733212.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Net profit of LIC rises 11.75% year-on-year in FY24",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The net profit of Life Insurance Corporation of India (LIC) increased by 11.75% year-on-year in financial year 2023-24. It surged to over ₹40,675 crore from ₹36,397 crore from the year-ago period. The net profit in the quarter ending on March 31 saw a 2.5% year-on-year rise at ₹13,762 crore. LIC's asset quality improved in the final quarter, the company said.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/business\/earnings\/lic-q4-net-profit-rises-marginally-to-rs-13762-cr-asset-quality-healthy-announces-rs-6-interim-dividend-12733090.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"SBI alerts customers about fake messages, reward points",
        "date":"Monday, 27 May, 2024",
        "descriptions":"SBI has alerted its crores of customers about receiving many fake messages. Customers are being warned about fake reward point redemption notifications. The bank has advised customers not to click on any link sent through SMS or WhatsApp nor download any application or file. The bank has said that it never sends links on SMS or WhatsApp.",
        "urls":"https:\/\/www.businessleague.in\/sbi-alerts-crores-of-customers-did-you-receive-such-an-sms-on-your-mobile\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Banks will remain closed for 12 days in June",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Apart from State Bank of India (SBI), all public and private sector banks are going to remain closed for 12 days in the month of June. The 12 days of holidays in June include the second and fourth Saturdays of the month and all Sundays. There are 5 Saturdays in the month of June.",
        "urls":"https:\/\/www.businessleague.in\/bank-holidays-in-june-2024-banks-will-remain-closed-for-12-days-in-june-check-rbis-list-of-holidays\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Why did Paytm shares hit 5% upper circuit today?",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The shares of One97 Communications, the parent company of Paytm, hit 5% upper circuit on NSE on Monday. This comes after the fintech firm said that it has intensified its focus on insurance distribution to Paytm consumers and small merchants and SMEs. Paytm shares closed at ₹357.95 today against the previous close of ₹340.90 on the NSE.",
        "urls":"https:\/\/www.cnbctv18.com\/market\/paytm-share-price-why-the-stock-hit-5-pc-upper-circuit-today-explained-19418345.htm\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"RBI fines ICICI bank ₹1 crore, Yes Bank ₹91 lakh",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The Reserve Bank of India has imposed a monetary penalty of ₹1 crore on ICICI Bank for non-compliance with certain directions issued on 'Loans and Advances - Statutory and Other Restrictions'. The RBI also stated that it fined Yes Bank ₹91 lakh for non-compliance with certain directions issued on 'Customer Service in Banks' and 'Un-authorized Operation of Internal\/Office Accounts'.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/business\/rbi-imposes-monetary-penalty-on-icici-bank-yes-bank-for-rule-violations-12733473.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"LIC announces highest-ever dividend at ₹6\/share, govt to get ₹3,662 cr",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Life Insurance Corporation of India (LIC) has announced a final dividend of ₹6 per share for the fiscal year 2023-24. It is also LIC's highest-ever payout to its shareholders as it paid a final dividend of ₹3 per share last year. As the majority stakeholder with 96.5% shares, the Government of India would reportedly receive ₹3,662 crore dividend from LIC.",
        "urls":"https:\/\/www.cnbctv18.com\/market\/lic-share-price-dividend-life-insurance-corp-govt-to-get-rs-3662-crore-record-date-july-19-19418495.htm\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Tier-3 towns showing highest demand for phone upgrades: Samsung",
        "date":"Monday, 27 May, 2024",
        "descriptions":"India's smaller towns are showing the maximum appetite for phone upgrades, helping Samsung post stronger value growth as volumes plateau in the smartphone industry, according to a top company executive. \"Something that we see today and where we're growing quite well is the Tier-III and below to categories like ₹20,000-30,000 segment,\" said Raju Pullan, senior VP, Samsung's smartphone division.",
        "urls":"https:\/\/www.ndtvprofit.com\/business\/samsung-says-tier-3-towns-showing-highest-demand-for-phone-upgrades?src=p1&utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Is the US bullish on DeFi? Nearly, says industry expert",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Crypto bill FIT21 sets new definitions for digital assets. The criteria determine if an asset is regulated as a security or commodity. It's a relief for the industry, but also comes with complications. Is it clear enough for the crypto industry? Nearly, says Rashan Colbert, head of policy at decentralised trading platform dYdX Trading.",
        "urls":"https:\/\/www.dlnews.com\/articles\/regulation\/how-the-fit21-bill-impacts-defi\/?utm_source=inshorts&utm_medium=referral&utm_campaign=inshorts_content_partnership&utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Honasa buys Cosmogenesis Labs to strengthen its R&D capabilities",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Honasa Consumer Ltd., the parent company of well-known personal care brands like Mamaearth, The Derma Co., Aqualogica, and Dr Sheth's, recently announced a strategic acquisition of CosmoGenesis Labs' assets. Founded in 2011, CosmoGenesis is a notable player in cosmetic formulation and development within the premium skincare sector.",
        "urls":"https:\/\/indianstartupnews.com\/news\/mamaearth-parent-honasa-acquires-cosmogenesis-labs-to-strengthens-its-r-and-d-capabilities-4613762?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"How Millennium is making a killing with BlackRock’s Bitcoin ETF",
        "date":"Monday, 27 May, 2024",
        "descriptions":"While some celebrated the $60 billion firm Millennium Management buying roughly $2 billion in various Bitcoin ETFs, the purchase is likely part of a more complicated trade. The Millennium had likely deployed a trading strategy called the \"basis trade\". The traders, who asked not to be named, don't work at Millennium but have relevant experience at Wall Street trading firms.",
        "urls":"https:\/\/www.dlnews.com\/articles\/snapshot\/how-millennium-is-making-a-killing-with-blackrocks-bitcoin-etf\/?utm_source=inshorts&utm_medium=referral&utm_campaign=inshorts_content_partnership&utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"BSNL to pay ₹132 cr to Boston Consulting Group for revival plan: Report",
        "date":"Monday, 27 May, 2024",
        "descriptions":"BSNL will be paying ₹132 crore to Boston Consulting Group (BCG) to prepare a three-year roadmap for its revival, Financial Express reported. BCG is reported to advise the state-owned telecom service provider in reducing operational cost, improving revenue and leveraging emerging technologies to improve sales, among others. BSNL has a target to achieve ₹35,960 crore operating revenue by 2027-28.",
        "urls":"https:\/\/www.financialexpress.com\/business\/industry-boston-consulting-group-to-draw-up-bsnls-revival-plan-3502328\/lite\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Cybercriminals posing as Police, CBI, ED and customs: NCRP",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Earlier this month, the Cyber Crime Reporting Portal (NCRP) stated that it has reported a large number of complaints regarding intimidation, blackmail, extortion, and Digital Arrests by cybercriminals posing as Police Authorities, CBI, Narcotics Department, ED, customs, and other Law Enforcement agencies.",
        "urls":"https:\/\/business.outlookindia.com\/personal-finance-news\/beware-of-scammers-putting-you-under-digital-arrests-look-out-for-these-obvious-signs?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"What happens to credit card debt if debtor dies suddenly?",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Credit card debt does not go away once you die. On the contrary, it is paid off using estate assets or it is managed by the joint account holder or cosigner. While your heirs can inherit other assets, they are not legally responsible for your credit card debts. The creditor might still contact them and ask them to pay.",
        "urls":"https:\/\/business.outlookindia.com\/banking\/what-happens-to-your-credit-card-debt-if-you-die-suddenly?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Delhi HC orders SpiceJet to return cannibalized aircraft & engines",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The Delhi High Court has upheld a previous order requiring SpiceJet Ltd. to comply with a UK court ruling and return two leased aircraft and three engines to TWC Aviation Capital (TWC). The court has set a deadline of June 17 for the return of the aircraft, engines, and technical records.",
        "urls":"https:\/\/www.ndtvprofit.com\/law-and-policy\/delhi-high-court-orders-spicejet-to-return-cannibalized-aircraft-and-engines?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Adani Energy Solutions to raise upto ₹12,500 crore",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Adani Energy Solutions Ltd (AESL) announced on May 27 plans to raise up to ₹12,500 crore via Qualified Institutional Placement (QIP) or other methods. The move requires approval at the Annual General Meeting on June 25. Recently, AESL acquired Essar Transco Ltd for ₹1,900 crore, expanding its network to over 21,000 circuit kilometres.",
        "urls":"https:\/\/www.siasat.com\/adani-energy-solutions-to-raise-upto-rs-12500-crore-3033619\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"IMD retains 'above normal' forecast for southwest monsoon",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The country is likely to see 'above normal' rainfall during monsoon season between June and September 2024, the IMD said, reaffirming its previous forecast. The southwest monsoon seasonal rainfall over the country as a whole is likely to be 106% of the long-period average with a model error of +- 4%, the IMD stated in a press release on Monday.",
        "urls":"https:\/\/www.ndtvprofit.com\/business\/imd-retains-above-normal-forecast-for-south-west-monsoon?src=p1&utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"ITC's Hotel Group expands in Rajasthan with 'Mementos Jaipur'",
        "date":"Monday, 27 May, 2024",
        "descriptions":"ITC's Hotel Group announced the opening of Mementos by ITC Hotels, Jaipur, its second Mementos property in India, after Mementos Udaipur. Anil Chadha, Chief Executive, ITC Hotels said, We are on an impressive growth trajectory and are delighted to offer a variety of hospitality solutions in Rajasthan, one of India's most vibrant and popular tourist attractions.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/itc-s-hotel-group-expands-in-rajasthan-with-mementos-jaipur-344240?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"SpiceJet rejects KAL Airways, Maran's ₹1,323-cr claims in damages",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"SpiceJet on Tuesday rejected claims made by KAL Airways and Kalanithi Maran, seeking ₹1,323 crore in damages from the airline and its chief Ajay Singh. \"These assertions are legally untenable,\" SpiceJet said. This comes after Delhi High Court overturned an order that had directed SpiceJet to refund over ₹270 crore to Maran.",
        "urls":null
    },
    {
        "category":"business",
        "titles":"Many made fun of UPI, they had no idea of our tech's strength: PM",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Prime Minister Narendra Modi said UPI has played a big role in fintech. \"It is unfortunate that when I was discussing UPI, many great scholars who were sitting in the Parliament made fun of it...They had no idea of India's potential and its technology's strength,\" he said. \"UPI is passing every test...India is leading in fintech today,\" he added.",
        "urls":"https:\/\/www.youtube.com\/watch?t=33s&utm_campaign=fullarticle&v=y9RYjyUKXxY&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"One way to bring down inflation is to kill the economy: Rajan",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Former RBI Governor Raghuram Rajan said one of the ways to bring down inflation is to \"kill the economy\" by exorbitantly raising interest rates. \"The problem with that is our poorest people don't have buffers. So if you reduce...economic activity, you're essentially condemning them to absolute misery,\" Rajan said. \"So...you can slow the economy but can't kill it,\" he added.",
        "urls":"https:\/\/youtu.be\/K_w5eT9JpBU?t=292&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Promoter to offload 5% stake in Inox Wind",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Inox Wind shares began Tuesday’s session lower at ₹155, down from ₹164.15. The shares hit a lower circuit at ₹147.75 apiece as approximately 2.75 crore shares, or 5% of the company's equity, traded in a block deal. The transaction, valued at over ₹400 crore, likely involved promoter entity IWEL selling its stake.",
        "urls":"https:\/\/tradebrains.in\/features\/green-energy-stock-hits-10-lower-circuit-after-promoter-to-offload-5-stake-in-the-company\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Promoter offloaded 6.6% stake in Timken India",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Timken India Ltd shares, a major supplier of axle bearings for heavy commercial vehicles, rose 7.5% to ₹4,250.45 after 5 million shares (6.6% of total equity) changed hands in block deals. Timken Singapore, the promoter, aimed to sell this stake at ₹3,550 per share, for a value of ₹1,775 crore as per reports.",
        "urls":"https:\/\/tradebrains.in\/features\/mid-cap-stock-jumps-7-after-companys-promoter-offloaded-6-6-stake-in-the-company\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Fineotex Chemical Board to meet and discuss raising funds via QIP",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Fineotex Chemical Board of Directors meeting will be held on June 01. It will consider the proposal for raising funds by the issue of one or more instruments comprising of equity shares, convertible securities of any other description or warrants or debt securities, through private placement\/preferential issue\/qualified institutions placement (QIP) or such other methods or combinations thereof.",
        "urls":"https:\/\/www.dsij.in\/dsijarticledetail\/articleid\/38443\/artmid\/10163\/preview\/true?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Rupee weakens marginally against US dollar on Tuesday",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Indian rupee weakened marginally against the US dollar on Tuesday with caution ahead of key inflation readings from the US and other major economies this week for more signals about interest rate policy. Moreover, a recovery in crude oil prices and foreign fund outflows have also weighed on rupee sentiments.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/rupee-weakens-marginally-against-us-dollar-on-tuesday994157?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Va Tech Wabag receives an order worth ₹85 crore from Oman",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Va Tech Wabag Ltd shares rose about 3%, reaching a high of ₹1,005, following the announcement of an order worth approximately ₹85 crores from Nama Water Services in Oman. The contract involves the operation and maintenance of the Al Duqm Desalination Plant for five years. Va Tech Wabag is engaged in the business of water treatment field.",
        "urls":"https:\/\/tradebrains.in\/features\/small-cap-stock-jumps-3-after-company-received-an-order-worth-85-cr-from-oman\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Gold prices steady as focus turns to US inflation data",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Gold prices held steady on Tuesday as the dollar eased, while investors looked forward to key US inflation data that could offer clues on how soon the Federal Reserve can cut interest rates. Spot gold held its ground at $2,349.89 per ounce, as of 06.00 GMT, after rising about 1% in the previous session.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/gold-prices-steady-as-focus-turns-to-us-inflation-data113527?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"National Aluminium Company net profit increased by 108 % QoQ",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"National Aluminium Company Ltd's shares rose 6% after a strong Q4FY24 performance. Net profit surged 95% YoY and 108% QoQ to ₹1,016 crore. Revenue increased 7% QoQ to ₹3,579 crore but decreased 2% YoY. These results highlight substantial profit growth despite a slight revenue dip year on year.",
        "urls":"https:\/\/tradebrains.in\/features\/psu-stock-jumps-6-after-companys-net-profit-increased-by-108-qoq\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Adani to enter UPI, online shopping businesses: Report",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Gautam Adani-led Adani Group is in talks to expand into e-commerce and digital payments business to rival Google and Mukesh Ambani's Reliance Industries, FT reported. Adani plans to apply for a licence to operate on UPI and is in talks with banks to finalise the Adani credit card. It's also in negotiations to offer online shopping through ONDC.",
        "urls":"https:\/\/www.hindustantimes.com\/business\/adani-group-to-enter-upi-digital-payment-credit-card-business-report-101716873123298-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Had received threats to lower interest rates: Ex-RBI Guv Rajan",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Economist Raghuram Rajan said during his tenure as RBI Governor, he received threats from business people to bring interest rates down. \n\"We were initially raising interest rates to bring inflation down,\" he said. \"I got a bunch of threats from business people saying 'You better reduce the interest rates or we will get you out of your job',\" he added.",
        "urls":"https:\/\/www.youtube.com\/watch?t=168s&utm_campaign=fullarticle&v=K_w5eT9JpBU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Infosys gives up to 85% performance bonus to workers in Q4: Report",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"IT company Infosys has issued quarterly performance bonus ranging from 55% to 85% to its employees at level 6 (PL6-manager) and below in the January-March quarter, Economic Times reported. This however excluded employees at the entry level. Employees said the average payout dropped to 60% from the 73% seen in October-December, the report added.",
        "urls":"https:\/\/www.etnownews.com\/companies\/infosys-q4-fy24-performance-bonus-update-payout-dips-details-article-110436880\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Natco Pharma net profit increased by 82% YoY",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Natco Pharma Limited engaged in developing, manufacturing, and marketing complex pharmaceutical products for niche therapeutic areas jumped 5% in the day’s trade upon posting its Q4FY24 results with an 82% jump in net profit from ₹212.7 crore to ₹386.3 crore and its revenue from operations grew by 41% from ₹758.6 crore to ₹1,068.3 crore.",
        "urls":"https:\/\/tradebrains.in\/features\/pharma-stock-jumps-5-after-companys-net-profit-increased-by-94-yoy\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Essel Industries sold 1.35 lakh shares in Ganesha Ecosphere",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ganesha Ecosphere Ltd shares rose 3.2% to ₹1,198.55 apiece after Essel Industries Pvt Ltd sold 1,35,398 shares at ₹1,150.14 each, as per NSE bulk deal data on May 27, 2024. The company specializes in recycling PET plastic bottle waste into polyester spun yarn, rPET fiber, and rPET yarn.",
        "urls":"https:\/\/tradebrains.in\/features\/stock-in-waste-recycling-sector-jumps-3-after-essel-ind-sold-1-35-lakh-shares-in-the-company\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"What are the gold prices in major cities today?",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The price of 10 grams of 24-carat gold remained steady at approximately ₹72,000 on Tuesday while the 22-carat gold price was stable at around ₹66,660. The 24-carat gold price was ₹72,870 in Delhi, Gurugram, Lucknow and Jaipur, while the rate was ₹72,770 in Ahmedabad and Patna. The gold rate was ₹72,720 in Mumbai, Kolkata, Bengaluru, Bhubaneswar and Hyderabad.",
        "urls":"https:\/\/www.news18.com\/amp\/business\/gold-rate-rises-in-india-check-22-carat-price-in-your-city-on-may-28-8906569.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"M.M. Forgings Ltd likely to announce bonus shares and dividend",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"One of the top gainers on BSE, shares of M.M. Forgings gained over 15% and made a fresh new 52-week high. It is holding a board meeting on Wednesday, May 29. The Board of Directors will consider issuing bonus shares to shareholders and propose an increase in the company's authorised share capital, subject to shareholder approval & dividend for FY24.",
        "urls":"https:\/\/www.dsij.in\/dsijarticledetail\/articleid\/38442\/artmid\/10163\/preview\/true?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Mafatlal Industries net profit increased by 175% YoY",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Mafatlal Industries Ltd's shares rose 7% after reporting significant financial growth. In Q4FY24, revenue increased 126% YoY and 81% QoQ to ₹764 crore, while net profit surged 175% YoY and 94% QoQ to ₹33 crore, reflecting strong performance improvements. Mafatlal Industries Limited manufactures textiles and trades them, as well as technology and other related products.",
        "urls":"https:\/\/tradebrains.in\/features\/textile-stock-jumps-7-after-companys-net-profit-increased-by-175-yoy\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Inox Wind shares locked in 10% lower circuit after large trades",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Shares of Inox Wind Ltd were locked in a lower circuit on Tuesday after two large trades. At least 6.03 crore shares, or 6% stake, changed hands in two trades at an average price of ₹150 apiece, according to Bloomberg. The buyers and sellers have not been confirmed immediately.",
        "urls":"https:\/\/www.ndtvprofit.com\/buzzing-stocks\/inox-wind-shares-locked-in-lower-circuit-after-18-stake-change-hands?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Wipro tradings at ₹455.90; up by 0.74%",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Wipro is currently trading at Rs. 455.90, up by 3.35 points or 0.74% from its previous closing of Rs. 452.55 on the BSE. The scrip opened at Rs. 453.05, reaching a high of Rs. 457.20 and a low of Rs. 453.05, with 62,966 shares traded. Promoters hold 72.89%, Institutions hold 15.24%, and Non-Institutions hold 9.48% in the company.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/wipro-gains-on-collaborating-with-centre-for-brain-research705600?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Telecom networks' war for new subscribers extends to Africa",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"In an effort to improve its telecom capabilities, Ghana has inked agreements to develop 4G and 5G infrastructure with Tech Mahindra, Reliance Jio subsidiary Radisys, and other suppliers. The NextGen Infrastructure Company, supported by Ghana, is working with Tech Mahindra, Nokia, and Jio subsidiary Radisys to develop the infrastructure required to provide reasonably priced 5G mobile services.",
        "urls":"https:\/\/www.freepressjournal.in\/business\/airtel-vs-jio-the-war-for-new-subscribers-extends-to-africa?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"VA Tech Wabag moves up on securing order worth ₹85 crore",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"VA Tech Wabag has secured an order worth around ₹85 crore from Nama Water Services in the Sultanate of Oman towards Operation & Maintenance (O&M) of the Al Duqm Desalination Plant for a period of 5 years. Wabag constructed this 8 MLD Desalination Plant over 10 years back and was responsible for the O&M of the Plant until 2018.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/va-tech-wabag-moves-up-on-securing-order-worth-rs-85-crore956454?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Won't export wheat to import bread, wish to make both in India: PM",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Prime Minister Narendra Modi said the main aim behind his mission of 'Atmanirbhar Bharat' is to create opportunities for the country's talent and to ensure India's wealth doesn't go out. \"I can't make the mistake of exporting wheat and importing bread. I would want both of them to be created here,\" he said in an interview.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=4QbhNDe1HjU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Reduce 28% GST on ACs: Netizens amid ongoing heatwave",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The mercury scaled the summit of high temperatures fervently, with many cities and towns witnessing temperatures as high as a burning 50 degrees celsius. In the recent past many have demanded a change in the GST regime on important items like ACs. Along with other consumer durable items like refrigerators, ACs are marked in the highest GST slab of 28%.",
        "urls":"https:\/\/www.freepressjournal.in\/business\/reduce-28-gst-on-acs-netizens-demand-slash-in-taxes-amid-ongoing-heatwave?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Policybazaar's ₹677-cr shares change hands, Tencent likely seller",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Shares worth ₹677 crore of Policybazaar-parent PB Fintech exchanged hands on Tuesday at an average price of ₹1,228\/share. While the shares' sellers and buyers weren't immediately known, CNBC-TV18 reported that Tencent Cloud Europe was looking to offload a 1.2% stake in the insurance startup. Tencent Cloud Europe held a 6.26% stake in PB Fintech as of March 2024.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/business\/markets\/pb-fintech-sees-rs-677-cr-block-deal-after-tencent-cloud-europe-sells-stake-12733905.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Stock market may fall 10-20% in a day if BJP gets less than 250 seats: Ruchir",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Investor and Rockefeller International Chairman Ruchir Sharma told India Today, \"If the BJP gets less than 250 seats in the Lok Sabha elections, there will be a big knee-jerk negative reaction in the stock markets.\" He added, \"If that black swan scenario kind of thing happens, the market will be down 10-20% in a day...in a flash.\"",
        "urls":"https:\/\/www.hindustantimes.com\/business\/stock-market-may-fall-15-20-if-bjp-gets-less-than-250-seats-ruchir-sharma-predicts-101716866025314-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"South Korea, UAE discuss enhancing bilateral economic ties",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Korea-UAE Business Investment Forum, held in Seoul during the state visit of UAE President Mohamed bin Zayed Al Nahyan, brought together around 200 government officials and business leaders, including South Korean Trade Minister Cheong In-kyo and UAE Minister of State for Foreign Trade Thani bin Ahmed Al Zeyoudi, according to the Korea Chamber of Commerce and Industry (KCCI).",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/south-korea-uae-discuss-enhancing-bilateral-economic-ties322529?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Ex-Porsche engineer Manfred Harrer joins Hyundai in top role",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Hyundai hired Manfred Harrer, ex-Porsche engineer, who developed Taycan to boost EV performance. Harrer's new unit operates under the Research and Development division of Hyundai Motor and Kia, two key affiliates of the automotive group. Harrer reports to Yang Heui-won, president of the Hyundai-Kia R&D Division.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/ex-porsche-engineer-manfred-harrer-joins-hyundai-in-top-role164156?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"RBI penalizes ICICI and YES Bank for regulatory breaches",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"RBI imposed fines on ICICI Bank (₹1 crore) and YES Bank (₹91 lakh) for regulatory breaches. ICICI loaned entities without due diligence, while YES Bank charged fees for low-balance accounts and operated unauthorized internal accounts. Penalties stemmed from regulatory non-compliance, not customer dealings.",
        "urls":"https:\/\/newskarnataka.com\/business-economy\/rbi-penalizes-icici-yes-bank-for-regulatory-breaches\/28052024\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"LIC Q4 net profit ₹13,763 crore, dividend ₹6\/share declared",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Life Insurance Corporation of India (LIC) on Monday reported a 2.5 per cent increase in net profit at ₹13,763 crore for the January-March quarter of the financial year 2023-24 compared to the corresponding figure of ₹13,421 crore in the same period last year.The country's largest announced an interim dividend of ₹6 per share.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/lic-q4-net-profit-at-rs-13-763-crore-declares-dividend-of-rs-6-per-share148902?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Goldman Sachs ups India's GDP growth forecast",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Goldman Sachs revised India's GDP growth forecast to 6.7%, citing continued government investments in major infrastructure projects and significant dividends from the RBI. In India, growth remains strong. Core inflation is expected to bottom out in April-June and range from 4.0-4.5% in July-December, said the financial company.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/goldman-sachs-ups-india-s-gdp-growth-forecast569275?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"What is T+1 trading settlement that US returned to after 100 yrs?",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The T+1 settlement system refers to a system where the users receive shares and sellers receive funds one day after the transaction. T+0 settlement on the other hand lets the trade be settled on the day of the transaction itself. US is resuming T+1 settlement after around 100 years from Tuesday. Notably, India adopted the T+0 settlement this year.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/world\/wall-street-returns-to-t1-stock-trading-after-a-century-12733859.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"How do shares remain unclaimed and how can investors claim them?",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Shares worth over ₹25,000 crore remain unclaimed, as per government data. Shares may remain unclaimed due to out-of-date owner contact information, change in address, inoperative accounts, death of owners or owners still holding physical share certificates. Multiple companies help investors claim their investments through investment identification, document verification and claim processing.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/business\/personal-finance\/shares-worth-rs-25000-crore-lie-unclaimed-heres-how-you-can-reclaim-your-lost-investments-12731218.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"US stock market returns to T+1 settlement after around 100 years",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"US stock market is resuming T+1 trading settlement system from Tuesday. This comes around 100 years after it had stopped the system due to massive volume of trades and financial crisis. T+1 settlement is set to make trading shares in the Wall Street faster. Notably, India adopted T+1 settlement last year, and further upgraded to T+0 settlement this year.",
        "urls":"https:\/\/www.hindustantimes.com\/business\/us-markets-shift-wall-street-returns-to-t-1-stock-trading-after-a-century-101716864725162-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Fintech leaders hail PM Narendra Modi on India leading in UPI",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Fintech leaders on Monday hailed Prime Minister Narendra Modi on India leading in Unified Payments Interface (UPI), saying that the country's fintech landscape is now a hotbed for innovation, reflecting the nation's fearless spirit. India is home to more than 10,000 fintech companies working in diverse sectors and segments.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/fintech-leaders-hail-pm-narendra-modi-on-india-leading-in-upi185274?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"India's global fintech lead credited to UPI: PM Modi",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Driven by digital public infrastructure (DPI) models like unified payments interface (UPI), the country is now leading the global fintech ecosystem and several countries are ready to embrace the 'India Stack' solutions to empower the masses, Prime Minister Narendra Modi told IANS on Monday.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/india-leading-global-fintech-ecosystem-thanks-to-upi-pm-narendra-modi114131?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Awfis Space Solutions IPO subscribed over 100 times on last day",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"On the last day of bidding for the Awfis Space Solutions IPO, the issue was subscribed 108.56 times the amount available. Retail investors subscribed the issue 54.58 times, institutional investors subscribed 116.95 times, non-institutional buyers (NII) subscribed 129.81 times, and employee reserved category subscribed 25.20 times.",
        "urls":"https:\/\/www.ndtvprofit.com\/ipos\/awfis-space-ipo-allotment-how-to-check-allotment-status-listing-date-more?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Dollar ebbs as markets await key global inflation reports",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Currency moves were largely subdued in early Asia hours after a quiet overnight session due to holidays in Britain and the United States, but the overall mood was positive with world shares firming. In cryptocurrencies, bitcoin eased 0.47% to $69,255, while ether fell 0.2% to $3,882.20.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/dollar-ebbs-as-markets-await-key-global-inflation-reports799477?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Oil prices steady as investors await inflation data, OPEC+ meeting",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Oil prices were steady in early Asian trading on Tuesday as investors awaited inflation data to assess future US monetary policy and the production policy decisions from the OPEC+ meeting on June 2. The Brent crude July contract dropped 3 cents to $83.07 a barrel by 0038 GMT. The more-active August contract slipped 4 cents to $82.85.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/oil-prices-steady-as-investors-await-inflation-data-opec-meeting483277?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Why Ashok Leyland is upbeat on commercial vehicle sales in FY25",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ashok Leyland Ltd. is buoyant on domestic sales in the LCV, medium and heavy commercial vehicle segments in fiscal 2025 and sees further growth in its electric bus offerings as the government ramps up tenders, according to senior company executives. The company is also gearing up for international launch of an electric bus model to cater to UK, European buses.",
        "urls":"https:\/\/www.ndtvprofit.com\/business\/why-ashok-leyland-is-upbeat-on-commercial-vehicle-sales-in-fy25?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Average bonus for Infosys employees reduced to 60%",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Infosys has announced a quarterly performance bonus of 60% for employees in band six and below for January-March 2024, down from 73% in the previous quarter. Bonuses will range between 55% to 85%, with some employees receiving individual payouts in May. Additionally, Infosys is a top contender for building new central KYC repository for Govt: CKYCRR 2.0.",
        "urls":"https:\/\/trak.in\/stories\/average-bonus-of-infosys-employees-reduced-to-60-for-last-quarter\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"PNB will close your account if no transaction done in 3 years",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Customers of Punjab National Bank (PNB) will have their accounts closed if no transactions or balances are recorded for three years, effective after one month, to prevent misuse. Exceptions include linked Demat, minor, and certain statutory accounts. ICICI Bank has enabled overseas customers to make UPI payments in India using international mobile numbers.",
        "urls":"https:\/\/trak.in\/stories\/pnb-will-close-these-bank-accounts-check-latest-rules-from-pnb-for-account-holders\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Boring resumes can get job seekers hired: Google, Apple's ex-recruiter",
        "date":"Monday, 27 May, 2024",
        "descriptions":"HR consultant Stefanie Fackrell, who has looked at thousands of resumes for recruiting at companies like Google, Apple and Nvidia, advised job seekers to make their resumes \"boring\". \"No colours, no charts, no graphs, no pictures,\" said Stefanie on creating an ideal resume. \"By creating colourful resumes, you're just being a little gimmicky,\" Stefanie Fackrell told CNBC Make It.",
        "urls":"https:\/\/www.news18.com\/amp\/viral\/ex-google-hiring-expert-says-make-your-resume-boring-to-crack-the-interview-8905257.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Suzlon Energy CFO projects ₹20,000 cr revenue potential by 2026",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Suzlon Energy Ltd.'s 3.3-gigawatt order book has the potential to generate ₹19,986 crore in revenue over the next two years, according to Chief Financial Officer Himanshu Mody. On average, the company's revenue recognition per megawatt amounts to ₹6 crore, Mody told NDTV Profit in a television interview.",
        "urls":"https:\/\/www.ndtvprofit.com\/business\/suzlon-energy-cfo-sees-nearly-rs-20000-crore-revenue-potential-in-next-two-years?src=p1&utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"FIIs stood as net sellers in equities as per May 27 data: NSDL",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The FIIs as per Monday's data were net sellers in equity segment, while they were net buyers in debt segment, according to data released by the NSDL. In equity segment, the gross buying was of  ₹11235.38 crore against gross selling of ₹12172.46 crore. Thus, FIIs stood as net sellers of ₹937.08 crore in equities.",
        "urls":"https:\/\/investmentguruindia.com\/newsdetail\/fiis-stood-as-net-sellers-in-equities-as-per-may-27-data-nsdl953203?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"Pudumjee Paper Products net profits increased by 224% YoY",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Shares of Pudumjee Paper Products Ltd, a leading supplier in the paper industry, rose by 15% to ₹105 on Monday after the company announced Q4 FY23-24 and FY24 results, with net profits up 224% in Q4FY24 and 65.2% yearly. Revenues also increased by 12.36% in Q4FY24 and 3.46% yearly. Shares gained 109% in the last 6 months.",
        "urls":"https:\/\/tradebrains.in\/features\/paper-stock-jumps-15-after-companys-net-profits-increased-by-224-yoy\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"If BJP loses elections, markets may test pre-NDA levels: UBS",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Global brokerage firm UBS said if BJP loses power by failing to win the ongoing Lok Sabha elections, market valuations may fall to pre-NDA levels last seen in 2014. If BJP retains single-party majority, markets will likely remain positive, UBS added. In case BJP forms government with NDA, markets may be slightly less confident, it added.",
        "urls":"https:\/\/www.hindustantimes.com\/business\/ubs-warning-for-stock-markets-if-bjp-loses-nifty-valuations-can-crash-to-101716797834994-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Investors richer by ₹1.5 lakh crore in a day as Sensex hits 76,000",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Investors wealth rose by ₹1.5 lakh crore on Monday as the benchmark indices Sensex and Nifty hit all-time-high records. BSE Sensex rose 599 points to hit 76,000 for the first time. NSE Nifty also hit a fresh peak of 23,110. The top gainers on Sensex were Axis Bank, HDFC Bank, SBI, Infosys and others.",
        "urls":"https:\/\/www.hindustantimes.com\/business\/stock-market-today-investors-earn-1-51-lakh-crore-215-stocks-hit-52-week-high-101716800057611-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"business",
        "titles":"Veranda Learning Solutions partners with Karnataka Govt",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Shares of Veranda Learning Solutions Limited jumped 17.7% to ₹183.3, after commencing work as a Training Partner with Karnataka Skill Development Corporation (KSDC) to assist in the implementation of the Wealth Management Course, a part of the Kalike Jothege Kaushalya, a state government initiative to provide skill development and career guidance to students in government colleges.",
        "urls":"https:\/\/tradebrains.in\/features\/small-cap-stock-jumps-17-after-company-partners-with-karnataka-govt\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"business",
        "titles":"M M Forgings board to consider bonus share",
        "date":"Monday, 27 May, 2024",
        "descriptions":"M M Forgings Ltd shares surged 14%, reaching a 52-week high of ₹1,300, after announcing a Board Meeting on 29 May 2024 to consider Q4 and FY24 financial results, dividend declaration, and a proposal to issue bonus shares for the first time in six years. The last bonus issue was in 2018 at a 1:1 ratio.",
        "urls":"https:\/\/tradebrains.in\/features\/auto-ancillary-stock-jumps-14-after-companys-board-to-consider-bonus-share\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    }
]