[
    {
        "category":"politics",
        "titles":"Had said she'll be arrested next: Kejriwal as court summons Atishi",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"After a court summoned Delhi minister Atishi in a defamation case, CM Arvind Kejriwal said, \"I had said earlier that they will arrest Atishi next. They are planning to do so now.\" Calling the case \"completely flimsy, frivolous and false\", he claimed that all Opposition leaders will be arrested if PM Narendra Modi comes back to power.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/arvind-kejriwals-atishi-next-prophecy-after-defamation-summons-to-delhi-minister-101716902074478-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Ravi Kishan calls Shashi Tharoor 'angrez aadmi'",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ravi Kishan, BJP's candidate from Gorakhpur, called Congress leader Shashi Tharoor an \"angrez aadmi\" for doubting BJP's chances in the Lok Sabha elections. Kishan highlighted his Bhojpuri roots and efforts to get the language recognized. Uttar Pradesh votes in seven phases, with BJP and Congress-Samajwadi in a key contest.",
        "urls":"https:\/\/www.thehawk.in\/posts\/bjp-candidate-ravi-kishan-calls-shashi-tharoor-%22angrez-aadmi%22?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Court reserves decision on Bibhav Kumar's 5-day custody",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"A court has reserved its decision on the Delhi Police’s request for five more days of custody for Bibhav Kumar, an aide to Chief Minister Arvind Kejriwal. Kumar is accused of assaulting AAP MP Swati Maliwal. The decision was made after Kumar's four-day custody ended. His lawyer opposed the request, saying there is no evidence.",
        "urls":"https:\/\/www.thehawk.in\/posts\/court-reserves-order-on-delhi-police's-plea-seeking-5-day-custody-of-bibhav-kumar?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Ireland recognises Palestinian state officially",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ireland officially recognised Palestine as a country, despite Israel's objections. The government approved the decision and will set up full diplomatic relations, including an embassy and an ambassador. Prime Minister Simon Harris said this move supports a two-state solution for peace between Israel and Palestine.",
        "urls":"https:\/\/www.thehawk.in\/posts\/ireland-officially-recognises-palestinian-state?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Good bye Narendra Modi! 7 days left for fake fakir: Rahul Gandhi",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Continuing his attack on Narendra Modi-led central govt Rahul Gandhi said, \"After June 4, Good Bye BJP, Good Bye Narendra Modi, Tata! Only 7 more days are left for the fake fakir who cheats the public. INDIA is getting votes - Khatakhat Khatakhat! The country will get freedom from BJP, ache din are about to come- Fatafat Fatafat!\"",
        "urls":"https:\/\/www.topindiannews.com\/national\/good-bye-narendra-modi-7-days-left-for-fake-fakir-rahul-gandhi-video-mkir-news-18213?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"PM Modi accuses TMC of snatching OBC rights and vote jihad",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Prime Minister Narendra Modi criticised the TMC government in West Bengal for taking away OBC youth rights to support its appeasement politics and \"vote jihad.\" Speaking in Barasat, Modi accused Mamata Banerjee of attacking the judiciary after unfavorable High Court rulings and condemned TMC's comments against religious groups.",
        "urls":"https:\/\/www.thehawk.in\/posts\/tmc-snatched-rights-of-obcs-to-facilitate-its-appeasement-politics-'vote-jihad'-says-pm-modi?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"No review was conducted in phone-tapping case: Revanth Reddy",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Telangana Chief Minister A Revanth Reddy on Tuesday said the investigation into sensational phone-tapping was continuing and no review was conducted so far in connection with the case. Interacting with media persons in New Delhi, he said a decision on the issue related to Medigadda barrage would be taken only after getting the judicial inquiry report.",
        "urls":"https:\/\/www.deccanchronicle.com\/southern-states\/telangana\/no-review-was-conducted-so-far-in-phone-tapping-case-says-revanth-reddy-896139?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"BJP wants to arrest all AAP leaders: Kejriwal",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Delhi Minister Atishi was summoned by a Delhi court in a defamation case filed by BJP's Praveen Shankar Kapoor. CM Kejriwal called it \"dictatorship\" and claimed BJP plans to arrest AAP leaders. Atishi questioned how BJP forms governments in various states. BJP's Bansuri Swaraj accused AAP of making false allegations.",
        "urls":"https:\/\/www.thehawk.in\/posts\/%22bjp-planning-to-arrest-all-aap-leaders...%22:-arvind-kejriwal-after-delhi-court-summons-atishi-in-defamation-case?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Delhi Court summons Atishi over BJP 'Poaching' defamation case",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Delhi's Rouse Avenue Court has summoned AAP Minister Atishi on June 29 in a defamation case filed by BJP's Delhi media head, Praveen Shankar Kapoor. Atishi is accused of making false 'poaching' allegations. She questioned how BJP forms governments without a majority and why cases against BJP-joining leaders are closed. BJP's Bansuri Swaraj responded, saying AAP often makes false accusations.",
        "urls":"https:\/\/www.thehawk.in\/posts\/delhi-court-summons-atishi-in-defamation-case-over-'poaching'-remark-against-bjp?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"News24 exit poll predicting AAP win in West Delhi is a deepfake",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"A video purporting to show News24's Manak Gupta predicting AAP's candidate win from West Delhi in the Lok Sabha elections is fake and has been created using AI-generated voice clone of Gupta. BOOM found that the claims are false; both Manak Gupta and the verified handle of Today's Chanakya exit poll on X clarified that the video was a deepfake.",
        "urls":"https:\/\/www.boomlive.in\/fact-check\/news24-manak-gupta-today-chanakya-exit-poll-fact-check-25449?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Kejriwal's aide Bibhav Kumar's bail application dismissed in Swati Maliwal assault case",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Delhi's Tis Hazari court has dismissed the bail application of CM Arvind Kejriwal's close aide Bibhav Kumar in connection with AAP MP Swati Maliwal assault case. Maliwal, who accused Bibhav of beating her up at Kejriwal's residence, told the court that her life and her family's life would be in danger if he is granted bail.",
        "urls":"https:\/\/x.com\/ANI\/status\/1795062345216975133?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"'Punjab Minister Balkar masturbated on video call with job seeker,' says BJP; shares proof",
        "date":"Monday, 27 May, 2024",
        "descriptions":"BJP has accused Punjab Minister and AAP leader Balkar Singh of masturbating in front of a 21-year-old woman job seeker on a video call. Sharing a footage that purportedly shows the minister, BJP leader Tajinder Bagga said that Balkar also forced the woman to remove her clothes. This comes days before voting in Punjab for the Lok Sabha elections.",
        "urls":"https:\/\/www.freepressjournal.in\/india\/punjab-ls-elections-2024-aap-minister-balkar-singh-indulged-in-sexual-activity-on-video-call-with-female-job-seeker-alleges-bjps-tajinder-bagga-sharing-shocking-footage?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Amit Shah predicts Congress to win under 40 seats, SP under 4",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Union Minister Amit Shah predicts that Congress will win less than 40 seats and Samajwadi Party only 4 in the Lok Sabha elections. He claims Narendra Modi will stay as Prime Minister. Shah says Congress will blame Electronic Voting Machines (EVMs) for their loss while criticising Rahul and Akhilesh Yadav as out-of-touch \"princes\".",
        "urls":"https:\/\/www.thehawk.in\/posts\/%22rahul-baba-will-not-even-cross-40-seats-akhilesh-not-even-4%22:-amit-shah's-poll-prediction?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Woman makes Manoj Tiwari wait to meet son, he shares video",
        "date":"Monday, 27 May, 2024",
        "descriptions":"BJP MP Manoj Tiwari was made to wait at a shop by a woman when he went to campaign for PM Narendra Modi in Varanasi. In the video, the woman can be seen calling her son and asking him to come to meet Tiwari. Sharing the video, Tiwari jokingly said, \"When Manoj Tiwari was held hostage by a woman.\"",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=Mz48N8y4yMg&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Was on trip abroad, saw allegations against me on YouTube: Prajwal",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Ex-PM Deve Gowda's grandson Prajwal Revanna, who's accused of sexually assaulting multiple women, has claimed that he was on a pre-planned foreign trip and saw the allegations against him on YouTube. The suspended JD(S) leader will appear before the SIT on May 31. He also apologised to his family and party workers for not providing \"proper\" information about his whereabouts.",
        "urls":"https:\/\/news.abplive.com\/karnataka\/prajwal-revanna-releases-video-statement-apologise-to-my-parents-will-appear-before-sit-on-may-31-1690630\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Rape accused Prajwal Revanna, who fled India, to join probe on May 31",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Prajwal Revanna, the rape-accused suspended JD(S) MP from Karnataka and former PM HD Deve Gowda's grandson, has said he will appear before the Special Investigation Team on May 31. \"I was depressed and went into isolation,\" said Prajwal who had fled the country on April 27. There are allegations of mass sexual harassment against him.",
        "urls":"https:\/\/x.com\/PTI_News\/status\/1795045604046827612?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Woman who accused ex-K'taka CM Yediyurappa of sexually abusing daughter dies",
        "date":"Monday, 27 May, 2024",
        "descriptions":"A woman who accused former Karnataka CM and BJP leader BS Yediyurappa of sexually harassing her minor daughter died at a private hospital in Bengaluru on Sunday. Police said the woman was suffering from cancer and was hospitalised after complaining of breathing issues. She had alleged Yediyurappa sexually abused her daughter when they sought his help in a rape case.",
        "urls":null
    },
    {
        "category":"politics",
        "titles":"Stage breaks as Rahul, Misa & Tejashwi arrive at rally in Bihar",
        "date":"Monday, 27 May, 2024",
        "descriptions":"A video showing a stage nearly collapsing as Congress' Rahul Gandhi, RJD's Tejashwi Yadav and other leaders arrive at an election rally in Bihar's Paliganj has surfaced online. In the video, Rahul is seen holding RJD MP Misa Bharti's hand as the stage breaks with Tejashwi behind them. The seventh phase of Lok Sabha elections will occur on June 1.",
        "urls":"https:\/\/www.latestly.com\/socially\/india\/news\/bihar-stage-nearly-collapses-during-rahul-gandhi-tejashwi-yadavs-election-rally-in-pataliputra-video-surfaces-5993395.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"'My name will never be erased': Mamata Banerjee",
        "date":"Monday, 27 May, 2024",
        "descriptions":"West Bengal CM Mamata Banerjee caused controversy by saying, \"Ramayana, Mahabharata, Quran, Bible will end, but my name will never be erased.\" This statement upset many, and opposition parties are asking for an apology. Protests have started, and experts think this could affect her in the upcoming elections.",
        "urls":"https:\/\/www.thehawk.in\/posts\/%22my-name-will-never-be-erased%22:-mamata-banerjee's-controversial-statement?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Congress accuses ministers of lies in Kerala liquor policy",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Congress on Sunday, May 26, continued its attack against the Left government in Kerala over its liquor policy. The party accused Excise Minister MB Rajesh and Tourism Minister PA Mohammed Riyas of \"lying\" to the public by claiming that no discussion had taken place regarding the scrapping of the \"dry day\" norm.",
        "urls":"https:\/\/thesouthfirst.com\/kerala\/kerala-liquor-policy-row-congress-accuses-ministers-of-blatant-lies-demands-judicial-probe\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Will appear before police on May 31: Prajwal Revanna",
        "date":"Monday, 27 May, 2024",
        "descriptions":"MP Prajwal Revanna, absconding after sex tapes leaked and sexual harassment allegations were levelled against him, announced he will be present before the SIT on May 31. \"Don't mistake me, on the 31st at 10 am, I will be in front of the SIT and I will cooperate. I trust the law,\" he said.",
        "urls":"https:\/\/topindiannews.com\/national\/will-appear-before-police-on-may-31-prajwal-revanna-vows-cooperation-in-probe-mkir-news-18143?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"PM will say he was sent by God when ED will ask him about Adani after June 4: Rahul",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Congress' Rahul Gandhi said when ED will ask PM Narendra Modi about Adani after elections, he'll say he doesn't know anything and he was sent by 'parmatma'. \"PM says that he doesn't take decisions, but they're taken by 'parmatma'. He says he isn't biological but a messenger of 'parmatma',\" Rahul said. The election results will be announced on June 4.",
        "urls":"https:\/\/x.com\/ANI\/status\/1794997213698945189?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Rahul Gandhi holidays abroad, PM spends Diwali with jawans: Shah",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Union Home Minister Amit Shah on Sunday, May 26, said the ongoing Lok Sabha polls were a choice between Prime Minister Narendra Modi, who celebrated Diwali among Armymen, and Congress leader Rahul Gandhi, who “rushes abroad for vacations whenever the weather becomes uncomfortable”. He also said that unlike Gandhi, Modi worked hard to reach the top.",
        "urls":"https:\/\/thesouthfirst.com\/politics\/rahul-gandhi-enjoys-vacations-abroad-pm-modi-celebrates-diwali-with-jawans-amit-shah\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"I got rape & death threats after a YouTuber made video against me: Maliwal in court",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Swati Maliwal, during bail plea hearing of Bibhav Kumar on Monday, said she was called a \"BJP agent\" by AAP leaders. \"A very big YouTuber...made a one-sided video. After that, I received rape and death threats,\" she said. Maliwal earlier shared screenshots of the alleged threats, saying they were exacerbated by Dhruv Rathee's video on her assault case.",
        "urls":null
    },
    {
        "category":"politics",
        "titles":"Karnataka govt working to shelter militants: Pralhad Joshi",
        "date":"Monday, 27 May, 2024",
        "descriptions":"BJP MP Pralhad Joshi on Sunday, May 26, accused the Karnataka Congress government of working towards providing “shelter to militants” in Hubballi. He also blamed the Siddaramaiah-led government for Hassan MP Prajwal Revanna, accused in multiple sexual assault cases, fleeing the country. His allegation comes days after the NIA arrested one more accused in the Rameshwaram Cafe blast case.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/karnataka-government-working-to-provide-shelter-to-militants-questions-delay-in-prajwal-revannas-arrest-bjp-mp-pralhad-joshi\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"BJP's Bagga shares shocking footage of AAP minister Balkar Singh",
        "date":"Monday, 27 May, 2024",
        "descriptions":"On Monday, BJP leader Tajinder Pal Singh Bagga levelled shocking allegations against Punjab AAP Minister Balkar Singh, accusing him of indulging in a sexual activity with a woman job seeker on a video call. The shocking accusations come mere five days before Punjab goes for voting in Lok Sabha Elections 2024.",
        "urls":"https:\/\/www.freepressjournal.in\/india\/punjab-ls-elections-2024-aap-minister-balkar-singh-indulged-in-sexual-activity-on-video-call-with-female-job-seeker-alleges-bjps-tajinder-bagga-sharing-shocking-footage?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Your rival isn't your enemy: SC on rejecting BJP plea against halt on anti-TMC ads",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Supreme Court on Monday rejected West Bengal BJP's plea against a Calcutta High Court order restricting publication of its ads targeting TMC in the state. The apex court called the ads \"disparaging\". It added, \"We don't want to...promote further acrimony...This is not in the interests of the voter. Your rival is not your enemy.\"",
        "urls":"https:\/\/indianexpress.com\/article\/india\/sc-bjp-advertisements-poll-violations-lok-sabha-elections-9354284\/lite\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Maliwal breaks down in court during Bibhav's bail hearing in assault case",
        "date":"Monday, 27 May, 2024",
        "descriptions":"AAP Rajya Sabha MP Swati Maliwal broke down in court on Monday during the bail hearing of Delhi CM Arvind Kejriwal's aide Bibhav Kumar, who is accused of beating her earlier this month. Kumar's counsel N Hariharan told the court how could such an incident occur at the CM's residence. He also said that Maliwal's injuries could be self-inflicted.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/swati-maliwal-breaks-down-in-delhi-court-during-bibhav-kumars-bail-hearing-101716793873252-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"If he comes out of jail my life would be in danger: Swati on Bibhav Kumar's bail request",
        "date":"Monday, 27 May, 2024",
        "descriptions":"During the hearing of Arvind Kejriwal's close aide Bibhav Kumar's bail plea, AAP MP Swati Maliwal said, \"If he comes out, my life and my family's life would be in grave danger.\" Maliwal, who accused Bibhav of assaulting her at the Delhi CM's residence, claimed he's not an ordinary person and gets facilities even ministers don't get.",
        "urls":"https:\/\/www.ndtv.com\/india-news\/swati-maliwal-assault-case-bibhav-kumar-if-he-comes-out-swati-maliwal-opposes-bibhav-kumars-bail-request-5755360\/amp\/1?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"I won't resign from AAP, it doesn't belong to 2-3 people: Maliwal",
        "date":"Monday, 27 May, 2024",
        "descriptions":"AAP MP Swati Maliwal, who was allegedly assaulted by Delhi CM Arvind Kejriwal's aide Bibhav Kumar, has said that she will stay in the party because \"it does not belong to two or three people\". \"I've given [AAP] my sweat and blood too,\" she added. However, she said there's no possibility of a reconciliation between her and the party leadership.",
        "urls":null
    },
    {
        "category":"politics",
        "titles":"The term 'love jihad' originated from Jharkhand: PM Modi",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Addressing an election rally in Jharkhand's Dumka on Tuesday, PM Narendra Modi said the term \"love jihad\" originated from Jharkhand. \"Jharkhand people have given this word...Our tribal daughters have come under the target of infiltrators...The lives of daughters are at risk,\" he added. He claimed daughters of Jharkhand were being burnt alive and asked why the JMM government supported this.",
        "urls":null
    },
    {
        "category":"politics",
        "titles":"Woman who accused Yediyurappa of sexually harassing daughter dies",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"A woman, who accused BJP leader Yediyurappa of sexual harassment died at a private hospital in Bengaluru on Monday. She was suffering from various ailments, including cancer. On March 14, she complained to Sadashivanagar police that Yediyurappa had sexually harassed her daughter. Yediyurappa was booked under the POCSO Act and the case was transferred to CID for further investigation.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/woman-who-accused-former-cm-yediyurappa-of-sexually-harassing-minor-daughter-dies-at-hospital\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"SC asks Arvind Kejriwal to submit bail extension plea to CJI",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Supreme Court on Tuesday declined to hear Delhi CM Arvind Kejriwal's request for a 7-day extension of his interim bail, directing him to present his plea to CJI DY Chandrachud, who will determine whether the application can be heard by the vacation bench. The Supreme Court is currently on its summer break and will resume on July 8, 2024.",
        "urls":"https:\/\/www.topindiannews.com\/national\/sc-asks-arvind-kejriwal-to-submit-bail-extension-plea-to-cji-mkir-news-18187?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Only Ram bhakt will rule on Delhi's throne: UP CM Yogi Adityanath",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Uttar Pradesh CM Yogi Adityanath said the 2024 Lok Sabha election is a contest between Ram devotees and traitors. He believes only a Ram devotee should rule Delhi. Speaking at a rally in Gorakhpur, he criticized Congress and Samajwadi Party for being against Ram, and urged people to support BJP.",
        "urls":"https:\/\/www.thehawk.in\/posts\/%22ram-bhakt-hi-raaj-karega-delhi-ke-singhasan-par%22:-up-cm-yogi-adityanath?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Dera chief Ram Rahim, 4 others acquitted in 2002 murder case",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Punjab and Haryana High Court has acquitted Gurmeet Ram Rahim Singh and four others in the 2002 murder case of Ranjit Singh. This overturns the life sentences given by the Special CBI court in Panchkula. The court found that there wasn't enough evidence to support the previous verdict.",
        "urls":"https:\/\/www.thehawk.in\/posts\/dera-chief-gurmeet-ram-rahim-4-others-acquitted-in-2002-ranjeet-murder-case?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"‘In depression’, says Prajwal, vows to appear before SIT on 31 May",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Exactly a month after he left the country, Hassan MP Prajwal Revanna, facing multiple charges of sexually assaulting women, said on Monday, 27 May that he will appear before the SIT probing the 'false cases' against him on 31 May. He apologized to his family, saying the charges made by Congress leaders sent him into depression but trusts the judiciary.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/in-depression-says-hassan-mp-prajwal-revanna-accused-of-sexual-abuse-vows-to-appear-before-sit-on-31-may\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"SC denies urgent hearing for Kejriwal's bail extension plea",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Supreme Court refused to urgently hear Delhi CM Arvind Kejriwal's request to extend his bail by seven days on medical grounds in the Delhi excise policy case. The bench said the Chief Justice would decide. Kejriwal needs more time for medical tests due to possible kidney issues.",
        "urls":"https:\/\/www.thehawk.in\/posts\/sc-refuses-urgent-hearing-of-arvind-kejriwal's-plea-seeking-extension-of-interim-bail?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"₹200 crore from Centre to Kerala to tackle water-logging capital",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Centre has offered ₹200 crore to Kerala under the Urban Mitigation Programme for Thiruvananthapuram which witnessed waterlogging during the recent pre-monsoon showers. Union Minister of State for Entrepreneurship, Skill Development, Electronics & Technology Rajeev Chandrasekhar, in a post on X, urged the Left government to submit a report to the Centre by the end of this month.",
        "urls":"https:\/\/thesouthfirst.com\/kerala\/%e2%82%b9200-crore-from-centre-to-kerala-to-tackle-water-logging-in-thiruvananthapuram-says-rajeev-chandrasekhar\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Karnataka will pay dues of PM's Mysuru visit last April",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Karnataka Forest Minister Eshwar Khandre has said the government will bear the pending hotel bill for when PM Narendra Modi visited Mysuru in April last year to inaugurate the 'Commemoration of 50 years of Project Tiger' programme and went on a wildlife safari. The cost came to ₹6.33 crore and the stay at a hotel cost ₹80 lakh.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/karnataka-government-will-pay-dues-of-pm-modis-visit-to-mysuru-in-april-2023-resolve-issue-amicably\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Work to protect Medigadda 'cut' out",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The forecast of above-normal rainfall during this year monsoon season may be great news for the country as a whole, but for irrigation department officials in Telangana, it could bring some trepidation on how the Godavari river will behave, given that they are desperately pushing for flood protection measures at the Sundilla, Annaram and Medigadda barrages of the Kaleshwaram project.",
        "urls":"https:\/\/www.deccanchronicle.com\/southern-states\/telangana\/work-to-protect-medigadda-cut-out-896048?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Even sarpanch can sign cheques but PM can't: PM Modi on allegation of 'using' ED & CBI",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"On allegations by the Opposition of using ED and CBI to suppress them, PM Narendra Modi said they don't know that even a sarpanch can sign a cheque but the Indian PM can't. He added the PM doesn't have any such rights. \"Modi government has told its officers that my government has zero tolerance towards corruption,\" he added.",
        "urls":"https:\/\/x.com\/ANI\/status\/1795314312287834275?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"BRS-era cops attempted to crack whatsApp calls",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Police of the State Intelligence Bureau (SIB) who illegally tapped phones during the tenure of the previous BRS regime had acquired high-end technology and attempted to intercept encrypted communications on platforms such as WhatsApp. According to a confession made by the accused, spying led to political leaders, judicial officers, and bureaucrats avoiding phone calls and using WhatsApp, Signal.",
        "urls":"https:\/\/www.deccanchronicle.com\/nation\/brs-era-cops-attempted-to-crack-whatsapp-calls-896083?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Andaman & Nicobar records 45.4% polling by 3 pm",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"By 3 pm, 45.48% of the 3,15,148 voters in Andaman and Nicobar Islands had voted for the lone Lok Sabha seat. The voting was peaceful. Seven members of the Shompen tribe voted for the first time. The main contest is between Congress MP Kuldeep Rai Sharma and BJP's Bishnu Pada Ray, with 12 candidates in total.",
        "urls":"https:\/\/www.thehawk.in\/posts\/andaman-and-nicobar-islands-records-45.4percent-polling-till-3-pm?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Should read Constitution: PM on Kejriwal's political arrests claim",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"During an interview with ANI, Prime Minister Narendra Modi reacted to Delhi Chief Minister Arvind Kejriwal's allegation that PM Modi decides who will go to jail. PM Modi said, \"It would be better if these people read the Constitution, read the law of the country.\" The PM further said, \"I do not need to say anything to anyone.\"",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=Z23xZtCBRTY&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Kangana's B'wood buzz won't work in Himachal: Vikramaditya Singh",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kangana Ranaut's 'Bollywood buzz' won't work in Himachal Pradesh, Congress leader Vikramaditya Singh, who is contesting against the actress-politician for the Mandi Lok Sabha seat, said. He added he doesn't care about the media buzz around the BJP candidate and is focused on the issues of youth, women and infrastructure of the state.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=a8w31m1yBsU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"At Bengal rally, Mamata refers to Narendra Modi as 'Caretaker PM'",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"West Bengal CM Mamata Banerjee referred to Modi as the 'caretaker PM' in a rally in the state. She said. \"Modiji has every right to campaign but I am surprised to see him being referred to as the PM in his party's campaign advertisements.\" In her address, she claimed that BJP will not return to power for a third term.",
        "urls":"https:\/\/www.timesnownews.com\/elections\/lok-sabha-election-at-bengal-rally-mamata-banerjee-refers-to-narendra-modi-as-caretaker-pm-says-article-110481325?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Spain, Ireland, Norway will recognize Palestinian statehood today",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Spain, Ireland, and Norway will recognize Palestine as a state, despite Israel's anger amid the Gaza conflict. This move aims to boost peace efforts and encourage other EU countries to do the same. With 144 UN member states already recognizing Palestine, this step hopes to strengthen the push for a ceasefire.",
        "urls":"https:\/\/www.thehawk.in\/posts\/spain-ireland-norway-set-to-recognise-palestinian-statehood-on-may-28?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Mexico presidency candidate Xóchitl Gálvez used to sell candy",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Xochitl Galvez is one of Mexico's top businesswomen, a computer engineer, and a candidate for the 2024 Presidential elections. Contesting from the conservative three-party coalition, she is set to take on former Mexico City mayor Claudia Sheinbaum. Galvez, who comes from an indigenous background, had an 'abusive alcoholic' dad, and she sold street food and candy to sustain a living.",
        "urls":"https:\/\/www.shethepeople.tv\/news\/xochitl-galvez-running-for-mexico-first-female-president-4613281?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Ready to sacrifice relation with Naveen for Odisha's progress: PM",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"PM Narendra Modi, while speaking about his relation with Odisha CM Naveen Patnaik, said that when it comes to development of a state he is ready to sacrifice his relations. \"After the elections, I will convince everyone that I have no enmity with anyone,\" he added. \"In a democracy we do not have enmity,\" PM further said.",
        "urls":"https:\/\/x.com\/ANI\/status\/1795317355691540750?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"I've become gaali-proof: PM Modi on being called 'gandi naali ka keeda' by Oppn",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Prime Minister Narendra Modi, on being asked about personal attacks made on him during the election campaigns during an interview with ANI, said, \"As far as Modi is concerned, after being continuously abused for the last 24 years, I have become 'gaali-proof'.\" \"Who called me the 'maut ka saudaagar' and 'gandi naali ka keeda'?\" he further said.",
        "urls":"https:\/\/www.news18.com\/amp\/elections\/lok-sabha-elections-have-become-gaali-proof-after-24-years-of-oppositions-abuses-says-pm-modi-8906501.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"SP MLA Rafiq Ansari arrested in 29-yr-old case after he defies 100 non-bailable warrants in UP",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Samajwadi Party's Meerut MLA Rafiq Ansari was arrested and sent to 14-day-judicial custody on Monday for not appearing before Allahabad High Court despite non-bailable warrants being issued in a 1995 case. He is accused of causing traffic jams and damaging property amid riots. Earlier, HC refused to grant him relief saying he defied 100 non-bailable warrants from 1997-2015.",
        "urls":"https:\/\/theprint.in\/india\/sp-mla-arrested-sent-to-14-day-judicial-custody-in-1995-case\/2104352\/?amp=&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Revanth hails UDF as role model for INDIA bloc",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Chief Minister A. Revanth Reddy presented the United Democratic Front (UDF) in Kerala as a role model for the INDIA bloc. Reddy commended the people of Kerala for protecting their culture and traditions and preventing communal forces from gaining a foothold in the state. \"The IUML is trustworthy organisation with a long-standing association with the Congress in Kerala.\" Reddy said.",
        "urls":"https:\/\/www.deccanchronicle.com\/southern-states\/telangana\/revanth-hails-udf-as-role-model-for-india-bloc-896067?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Spoke his mind: Tejashwi on Nitish's 'May Modi become CM' error",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Reacting to Bihar CM Nitish Kumar mistakenly saying that he wishes PM Narendra Modi becomes a CM again, RJD leader Tejashwi Yadav said, \"Dil ki baat zubaan pe aa jaati hai (what was in his mind slipped out of his mouth).\" \"What the CM Nitish said is correct... Modi ji is not going to become the PM again,\" Yadav added.",
        "urls":"https:\/\/repository.inshorts.com\/articles\/en\/PTI\/591b3d5b-1cdc-4832-855b-45b539c64a8f?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Abhishek wore ₹8,000 t-shirt during his visit to relief camp: BJP",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"BJP in West Bengal criticised TMC MP Abhishek Banerjee for allegedly wearing a ₹8,000 t-shirt during his visit to Cyclone Remal relief camps. Sharing picture comparing Abhishek's t-shirt, BJP said, \"Shame on TMC for mocking the poor and aggrieved.\" Earlier, TMC accused BJP of being indifferent to suffering of Bengal's people and focusing on organising a drone show in Kolkata.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/rs-8-000-t-shirt-bengal-bjp-slams-tmcs-abhishek-banerjee-after-cyclone-remal-relief-camp-visit-101716861571788-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Does he play tabla: Rabri on PM's 'mujra' remark on Opposition",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Reacting to PM Narendra Modi \"Opposition performing 'mujra' for vote bank\" remark, RJD leader Rabri Devi said, \"And what does Modi do? Play the tabla?\" On being asked to respond to PM Modi's comment that I.N.D.I.A bloc was receiving support from 'jihadis', she said, \"If it is indeed so, what are the intelligence agencies doing?\"",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=uYpSdtA9lZc&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Our govt focuses on transparency, UPA hid deficits: FM Sitharaman",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Finance Minister Nirmala Sitharaman took to X on Monday to criticise the previous Congress-led UPA government's budgetary practices. \"Our government has prioritized transparency in its budgeting practices and numbers. This starkly contrasts the Congress-led UPA government's repetitive practice of hiding the deficits through off-budget borrowings and issuance of 'Oil Bonds',\" she said.",
        "urls":"https:\/\/x.com\/nsitharaman\/status\/1794976075065540611?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Won't attend I.N.D.I.A bloc meet, I'm busy in relief work: Mamata",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"West Bengal CM Mamata Banerjee said that she will not attend the meeting of I.N.D.I.A bloc on June 1. She said she won't be attending the meet as there is relief work going on in state due to cyclone 'Remal'. Giving another reason, Mamata said she won't attend the meet because of last phase voting scheduled on June 1.",
        "urls":"https:\/\/www.news18.com\/amp\/elections\/my-priority-is-mamata-banerjee-to-skip-india-bloc-meeting-on-june-1-8906102.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Criminals pretending to be victims: Dhruv as Maliwal alleges threats after his video",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"YouTuber Dhruv Rathee put out a cryptic post on X after Swati Maliwal alleged she received death and rape threats after he released a video against her. \"Irony is that perpetrators are pretending to be victims. Everyone knows who is behind all this. They want to silence me,\" said Rathee. He said he was used to getting \"daily death threats\".",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/youtuber-dhruv-rathees-cryptic-post-after-swati-maliwals-death-threat-allegations-101716854459137-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"6 candidates to fight against PM Modi in Varanasi, 41 had filed nominations",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Forty-one candidates initially filed nominations from Varanasi to fight against PM Narendra Modi. While one withdrew the nomination, seven applications, including PM Modi's, passed the scrutiny process. The six include Congress' Ajay Rai, BSP's Ather Jamal Lari, Yuga Thulasi Party's Kolisetty Shiva Kumar, Apna Dal (Kameravadi)'s Gagan Prakash Yadav and Independent Dinesh Kumar Yadav.",
        "urls":null
    },
    {
        "category":"politics",
        "titles":"Rahul has become burden on his mother, he's 'desh-drohi': Himanta",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Assam CM Himanta Biswa Sarma criticised Congress leader Rahul Gandhi and said, \"The people of the country aren't going to give a chance to Rahul.\" Himanta said, \"Rahul cannot do anything to survive. He has become a burden on his mother.\" He added, \"Rahul Gandhi is a 'desh-drohi' (traitor) for making remarks against the Army, which will ultimately 'demoralise' them.\"",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=wzdqzVBsRy8&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Pakistan to revive China belt and road initiative projects",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Pakistan's new government is hoping to inject some fresh momentum into projects that fall under China's Belt and Road Initiative, as it tries to boost the country's troubled economy. The South Asian nation is looking at joint ventures for renewable energy projects, agriculture collaboration and possibly enticing some Chinese companies to relocate to Pakistan.",
        "urls":"https:\/\/www.ndtvprofit.com\/world\/pakistan-to-revive-china-belt-and-road-initiative-projects?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Relieved: Kumaraswamy as nephew Prajwal says he'll appear before SIT",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Former Karnataka CM and JD(S) leader HD Kumaraswamy has reacted to his nephew Prajwal Revanna's statement that he'll appear before the SIT, saying, \"It has brought us relief.\" Prajwal, who is accused of sexually abusing multiple women, reportedly escaped to Germany on April 27. \"I [had]...requested him to return if he has respect towards karyakartas,\" Kumaraswamy added.",
        "urls":"https:\/\/www.moneycontrol.com\/news\/india\/prajwal-revanna-to-return-to-india-appear-before-sit-on-may-31-12733363.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Were you doing disco dance with China?: Owaisi after PM's 'mujra' remark",
        "date":"Monday, 27 May, 2024",
        "descriptions":"AIMIM chief Asaduddin Owaisi criticised PM Narendra Modi over his \"Opposition performing mujra for vote bank\" remark. \"You talked about mujra, so Asaduddin Owaisi wants to ask you that for the last three years, China has occupied 2,000 square kilometres of Indian land, Modi ji, you aren't removing China, so were you doing disco dancing with China?\" he asked.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/modi-doing-disco-with-china-asaduddin-owaisi-on-pms-mujra-remark-at-opposition-101716815160922-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Gravely disturbed: NCW as BJP claims Balkar masturbated on call",
        "date":"Monday, 27 May, 2024",
        "descriptions":"National Commission for Women (NCW) has said that it's \"gravely disturbed\" by allegations against Punjab minister Balkar Singh and called for an urgent and impartial investigation by the state police into the matter. This comes as BJP claimed that Balkar masturbated on a video call with a female job seeker. The NCW also sought a comprehensive report in three days.",
        "urls":"https:\/\/news.abplive.com\/news\/india\/punjab-minister-balkar-singh-video-ncw-aap-bhagwant-mann-bjp-tajinder-bagga-congress-shiromani-akali-dal-charanjit-singh-channi-1690676\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Balkar Singh laughs off questions about obscene videos",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Punjab Minister Balkar Singh laughed when questioned about the viral obscene videos by media on Monday (May 27). After laughing off the serious questions, he agreed to talk to the media, only to say he had \"no comments\" to make on the grave allegations against him. \"I have no comments and (it's) not in my knowledge,\" he said.",
        "urls":"https:\/\/www.freepressjournal.in\/india\/punjab-minister-balkar-singh-shamelessly-laughs-when-questioned-about-viral-obscene-videos-ncw-calls-for-urgent-police-probe?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Man arrested in theft case throws slipper at magistrate in court in Rajasthan",
        "date":"Monday, 27 May, 2024",
        "descriptions":"A man arrested in a theft case hurled his slipper at the magistrate inside a courtroom in the Bhilwara district of Rajasthan on Monday. The man was taken to the local court for hearing in the case. The accused was sent to judicial custody again and a case was being registered against him.",
        "urls":"https:\/\/www.latestly.com\/agency-news\/latest-news-rajasthan-undertrial-hurls-slipper-at-magistrate-inside-courtroom-5994119.html\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"No comments: Balkar after BJP claims he masturbated on video call with job seeker",
        "date":"Monday, 27 May, 2024",
        "descriptions":"On being asked about BJP sharing a video purportedly showing him masturbating on video call with a 21-year-old female job seeker, Punjab Minister and AAP leader Balkar Singh said, \"No comments and not in my knowledge.\" BJP claimed that the minister even forced the woman to remove her clothes. The party demanded action against him.",
        "urls":"https:\/\/twitter.com\/ani\/status\/1795090972151251339?s=61&t=JeXDunnUUmSmZAFLsxwkMw&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"This should be investigated: PM Modi on Pak support for Rahul Gandhi, Kejriwal",
        "date":"Monday, 27 May, 2024",
        "descriptions":"After being asked about Pakistani leaders giving statements in favour of Rahul Gandhi and Arvind Kejriwal, PM Narendra Modi said that it was a serious matter that should be investigated. \"I don't think I should comment on such topics from the position I am in,\" he added. Recently, Pakistani politician Chaudhry Fawad Hussain shared posts praising Kejriwal and Rahul.",
        "urls":"https:\/\/www.ndtv.com\/india-news\/pm-narendra-modi-talks-of-probe-on-pak-support-for-rahul-gandhi-arvind-kejriwal-5756535\/amp\/1?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Delhi court denies bail for Kejriwal aide in Maliwal assault case",
        "date":"Monday, 27 May, 2024",
        "descriptions":"A Delhi court denied bail to Bibhav Kumar, an aide of Chief Minister Arvind Kejriwal, who is accused of assaulting AAP MP Swati Maliwal. Magistrate Gaurav Goyal rejected the bail, as Maliwal claimed she was receiving threats. Videos from the CM's residence show Maliwal arguing with security. A detailed order is awaited.",
        "urls":"https:\/\/www.thehawk.in\/posts\/swati-maliwal-assault-case:-delhi-court-rejects-bail-plea-of-kejriwal's-aide-bibhav-kumar?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"'Kangana’s Bollywood buzz won't work in HP': Vikramaditya Singh",
        "date":"Monday, 27 May, 2024",
        "descriptions":"\"Kangana Ranaut's Bollywood fame won't influence Himachal Pradesh voters,\" says Congress' Vikramaditya Singh. Competing against her in Mandi, Singh, in an interview, asserts his focus on local issues like youth, women, and infrastructure. Rejecting BJP's communal rhetoric, he prioritises national and state interests, reaffirming his commitment to Congress despite recent resignations.",
        "urls":"https:\/\/www.thequint.com\/elections\/kangana-ranaut-bollywood-buzz-wont-work-in-himachal-pradesh-vikramaditya-singh?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle#read-more"
    },
    {
        "category":"politics",
        "titles":"Close save for Rahul Gandhi as stage caves in during Bihar rally",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Rahul Gandhi had a close save on Monday when a portion of a stage caved in during a rally in Bihar. In the video of the incident, Lalu Prasad's daughter Misa Bharti can be seen holding Rahul's hand and helping him regain his balance. Rahul was present there to support Bharti who is contesting for the Patliputra Lok Sabha seat.",
        "urls":"https:\/\/www.freepressjournal.in\/india\/video-close-shave-for-rahul-gandhi-as-part-of-stage-caves-in-during-poll-rally-with-lalu-prasads-daugther-misa-bharti-in-bihar?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"SC refuses to stay HC order restraining BJP's 'slanderous' TMC ads",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The Supreme Court has refused to stay Calcutta High Court's order restraining BJP from publishing \"derogatory, slanderous and disparaging\" advertisements targeting TMC. \"We cannot promote further acrimony. Of course, you can promote yourself,\" the SC said, adding that the ads will only help the BJP, not the voter. \"You're magnifying the issue here. We're not inclined to interfere,\" it said.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/sc-criticises-disparaging-bjp-ads-against-tmc-refuses-to-interfere-with-hc-order-101716793348456-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"BJP opposes Muslim reservation to safeguard SC, ST & OBC: CM Yogi",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Uttar Pradesh CM Yogi Adityanath called religious reservations unconstitutional. He praised the Calcutta High Court for cancelling OBC certificates issued after 2010 in West Bengal, accusing TMC of wrongly adding 118 Muslim castes to the OBC category. He reaffirmed BJP's stance against Muslim reservations to protect SC, ST, and OBC quotas.",
        "urls":"https:\/\/www.thehawk.in\/posts\/bjp-against-muslim-reservation-to-protect-sc-st-obc-quota:-cm-yogi?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"AIMIM leader shot thrice in Maharashtra's Nashik",
        "date":"Monday, 27 May, 2024",
        "descriptions":"AIMIM leader was shot thrice in Nashik (Maharashtra) around 1:20 am when the perpetrators, riding a motorbike, opened fire at him. He was hit on the left side of his chest, his right hand, and his leg. Following the attack, Malik was immediately taken to a nearby hospital. According to police report, his condition is currently stable.",
        "urls":"https:\/\/www.topindiannews.com\/national\/watch-aimim-leader-shot-on-chest-video-of-aftermath-surfaces-mkir-news-18132?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Yogi took my Swachhta Abhiyan seriously, cleaned all UP mafias: PM",
        "date":"Monday, 27 May, 2024",
        "descriptions":"PM Narendra Modi while addressing a rally in UP praised CM Yogi Adityanath for his strict action against mafias. \"Yogi ji took my Swachhta Abhiyan very seriously and is taking it forward very well by continuously cleaning the miscreants,\" PM said. \"During SP's regime people used to be scared of mafias but now mafias are scared of government,\" PM added.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=tqJNxY5g1dA&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"UP court schedules Rahul's defamation case hearing for June 7",
        "date":"Monday, 27 May, 2024",
        "descriptions":"An MP-MLA court has scheduled a hearing on June 7 for the 2018 defamation case against Congress leader Rahul Gandhi. The case was filed by BJP leader Vijay Mishra over Gandhi's remarks about Amit Shah. Gandhi's lawyer asked for more time due to campaign work. Earlier, Gandhi paused his Bharat Jodo Nyay Yatra to attend court hearing and get bail.",
        "urls":"https:\/\/www.thehawk.in\/posts\/defamation-case-against-rahul-gandhi:-up-court-fixes-hearing-for-june-7?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Voting underway for MLC bypoll in Telangana",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Polling is underway for the Telangana Legislative Council by-election in the Warangal-Khammam-Nalgonda graduates’ constituency. Voting, from 8 a.m. to 4 p.m., involves 4,63,839 eligible voters at 605 polling centres. The main contest is among Congress, BRS, and BJP candidates. Congress aims to retain support by focusing on job promises.",
        "urls":"https:\/\/www.siasat.com\/voting-underway-for-mlc-bypoll-in-telangana-3033295\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Arvind Kejriwal seeks 7-day bail extension",
        "date":"Monday, 27 May, 2024",
        "descriptions":"CM Arvind Kejriwal has filed an application with the Supreme Court seeking an extension of his interim bail for an additional seven days. His application states that during his detention in Tihar jail, he has experienced a weight loss of 7 kg and currently ketone levels in his body are very high. He needs more time for PET-CT scans.",
        "urls":"https:\/\/www.topindiannews.com\/national\/arvind-kejriwal-seeks-7-day-bail-extension-but-on-what-grounds-mkir-news-18123?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"PM will build his own temples in every village: K'taka minister",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Karnataka minister Shivaraj Tangadagi on Saturday, May 25, said if BJP won the Lok Sabha elections again, Prime Minister Narendra Modi would build his own temples in every village. The remark came after Modi said in an interview with a national TV channel that after his mother’s demise, his experiences convinced him that he was sent by God.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/pm-modi-will-build-his-temples-in-every-village-if-bjp-wins-lok-sabha-pollskarnataka-minister-shivaraj-tangadagi\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"BJP protest in Kerala over waterlogged roads in state capital",
        "date":"Monday, 27 May, 2024",
        "descriptions":"BJP on Sunday, May 26, held a protest march demanding the resignation of Thiruvananthapuram Mayor Arya Rajendran, alleging that roads in Kerala’s capital were waterlogged and damaged and epidemics were on the rise due to the inefficiency of the city corporation. The protestors marched to the Thiruvananthapuram Corporation office with party flags and a banner demanding Rajendran’s resignation.",
        "urls":"https:\/\/thesouthfirst.com\/kerala\/rain-woes-bjp-protest-in-kerala-over-waterlogged-roads-in-state-capital-demands-mayors-resignation\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"AIMIM leader Abdul Malik critical after being shot at in Maharashtra",
        "date":"Monday, 27 May, 2024",
        "descriptions":"AIMIM leader and former Malegaon Mayor Abdul Malik was left grievously injured after two unidentified assailants opened fire at him, reports said on Monday. The incident happened around 1 am in the Malegaon city area when he was outside a restaurant on a highway. Reports said he sustained three bullet wounds, including on the left side of his chest.",
        "urls":"https:\/\/www.news18.com\/amp\/india\/aimim-leader-sustains-grave-injuries-after-unknown-assailants-open-fire-at-him-in-malegaon-8905253.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Women blessed me for 'Gruha Lakshmi', 'Shakti': Siddaramaiah",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Karnataka Chief Minister Siddaramaiah, who visited the temple town of Dharmasthala in Dakshina Kannada on Saturday, May 25. He said that women blessed him for the two prominent guarantees — 'Gruha Lakshmi' and 'Shakti' — with which they were able to lead a comfortable life and travel from faraway towns to see the deity.",
        "urls":"https:\/\/thesouthfirst.com\/karnataka\/karnataka-cm-siddaramaiah-says-women-blessed-him-for-gruha-lakshmi-and-shakti-guarantees\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Arrears, conflict with Union govt mar Kerala revenue gains",
        "date":"Monday, 27 May, 2024",
        "descriptions":"For some time now, Kerala has found itself walking a financial tightrope. There are persistent concerns over the state’s struggles to clear arrears it owes to pensioners and beneficiaries of various social security schemes. While the LDF government blames the BJP-led Union government for squeezing state finances, the other side of the coin is internal shortcomings contributing to the strain.",
        "urls":"https:\/\/thesouthfirst.com\/kerala\/keralas-economic-paradox-arrears-and-conflict-with-union-government-mar-revenue-gains\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Kejriwal seeks SC extension of interim bail on health grounds",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Delhi CM Arvind Kejriwal has asked the Supreme Court to extend his interim bail by seven days because of health issues, saying he lost seven kilograms. He got bail on May 10 to campaign for Lok Sabha elections. Kejriwal is involved in a money laundering case related to the 2021-22 Delhi excise policy scam. His bail ends on June 1.",
        "urls":"https:\/\/www.thehawk.in\/posts\/arvind-kejriwal-moves-sc-seeks-extension-of-interim-bail-in-money-laundering-case-on-health-grounds?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Bihar CM Nitish's helicopter runs out of fuel during poll campaign",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Bihar CM Nitish Kumar's helicopter ran out of fuel during election campaigning on Sunday, JD(U) MP Sanjay Jha told PTI. This happened when the CM had gone to Masaurhi to address a public meeting in favour of NDA candidate Ram Kripal Yadav. Later, Kumar proceeded to his next destination by road for another poll-related engagement.",
        "urls":"https:\/\/repository.inshorts.com\/articles\/en\/PTI\/6a95f48d-f4c0-4716-b611-2fbfcd3f505b?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"AP leaders want Hyderabad to continue as joint capital",
        "date":"Monday, 27 May, 2024",
        "descriptions":"When Chief Minister A. Revanth Reddy has prioritised the resolution of pending issues between the Telugu states, leaders from AP have started building up pressure on the Centre to continue Hyderabad as the joint capital. AP Congress vice-president Kolanukonda Shivaji had recently demanded that Hyderabad be allowed as the joint capital till 2034.",
        "urls":"https:\/\/www.deccanchronicle.com\/nation\/current-affairs\/ap-leaders-want-hyderabad-to-continue-as-joint-capital-895901?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Kejriwal asks SC to extend bail by 7 days, says 'have to undergo medical tests'",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Delhi CM Arvind Kejriwal, whom the Supreme Court granted interim bail, has filed a plea seeking to extend his bail by seven days. This extension is sought to get a PET-CT scan and other medical examinations, said the Aam Aadmi Party (AAP). He was granted bail till June 1 and was asked to surrender on June 2.",
        "urls":"https:\/\/www.hindustantimes.com\/india-news\/delhi-cm-arvind-kejriwal-seeks-7-day-extension-of-interim-bail-for-medical-tests-101716781096196-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"Modi doing disco dance, Bhangra: Owaisi on PM's 'mujra' remark",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Reacting to PM Narendra Modi's \"Opposition performing 'mujra' for vote bank\" remark, AIMIM chief Asaduddin Owaisi criticised PM saying was he doing \"disco\" when China was capturing Indian territory. \"CAA was brought to disenfranchise Muslims and Modi kept doing Bhangra on the issue,\" Owaisi added. PM was doing Bharatnatyam when statements were made against Muslims, Owaisi further said.",
        "urls":"https:\/\/www.siasat.com\/modi-doing-disco-dance-bhangra-owaisi-in-response-to-mujra-jibe-3033161\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"politics",
        "titles":"We don't need a 'Bekhabar PM': Kapil Sibal",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Rajya Sabha MP Kapil Sibal launched a scathing attack on PM Modi on Monday morning in a social media post. Kapil Sibal hit out at PM Modi, saying we don't need a \"Bekhabar PM.\" Kapil Sibal, who currently has no affiliation with any party, has been continuously attacking the Modi government over various issues during the general elections.",
        "urls":"https:\/\/www.freepressjournal.in\/india\/we-dont-need-abusive-divisive-manipulative-narcissistic-pm-kapil-sibal?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"politics",
        "titles":"Andhra Pradesh stares at capital city uncertainty",
        "date":"Sunday, 26 May, 2024",
        "descriptions":"As Hyderabad is all set to cease to be the joint capital of AP and T'gana on 2 June, the fate of a capital city and its geographical location for the residual AP hangs in the balance even 10 years after the bifurcation. While CM Jagan has come up with a three capital cities proposal, TDP remains committed to Amaravati.",
        "urls":"https:\/\/thesouthfirst.com\/andhrapradesh\/andhra-pradesh-stares-at-capital-city-uncertainty-as-hyderabad-set-to-cease-to-be-joint-capital\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    }
]