[
    {
        "category":"sports",
        "titles":"Coach only takes the team from field to hotel in T20s: Atul Wassan",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ex-India cricketer Atul Wassan said the role of a coach should be removed in T20s, adding that a mentor should be part of the team setup instead. \"West Indies ruled cricket from 1979 to 1989. Was it because of their coach?\" he added. \"Work of a coach is limited to taking the team from the field to hotel,\" he stated.",
        "urls":"https:\/\/www.hindustantimes.com\/cricket\/ms-dhoni-will-have-more-respect-not-gautam-gambhir-virat-kohlis-coach-wants-msd-as-rahul-dravids-replacement-101716868099123-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Shadab has misconception that he is a good batter: Sikandar Bakht",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ex-Pakistan cricketer Sikander Bakht said Pakistan all-rounder Shadab Khan has misconception that he's a good batter. \"I wonder what sort of cricketers these are...Babar Azam doesn't want to give his place and won't come down batting order. His psyche's beyond my understanding,\" he added. \"It seems this Pakistan team's designed just around Babar, Muhammad Rizwan and Fakhar Zaman,\" he stated.",
        "urls":"https:\/\/www.timesnownews.com\/sports\/cricket\/cant-understand-babar-azams-psyche-pakistan-cricket-team-created-for-just-3-players-article-110485158\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Rishabh Pant discusses wheelchair insecurities post-accident",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Rishabh Pant shared his experience and insecurities after a terrible car accident, which left him nervous about facing people while using a wheelchair. One of the most difficult aspects of his recovery was dealing with his insecurities about being seen in a wheelchair. Pant admitted that he felt nervous and self-conscious about how people would perceive him.",
        "urls":"https:\/\/cricfit.com\/rishabh-pant-discusses-wheelchair-insecurities-post-accident\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Yuvraj feels Abhishek is even better than him: Abhishek's father",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"SRH cricketer Abhishek Sharma's father Rajkumar said Yuvraj Singh sees himself in Abhishek and believes Abhishek is better than him. \"Abhishek got reality check when Shubman Gill cemented his place in all formats [in Indian team]. He said, '[What I'm doing] isn't enough,\" added Rajkumar. \"Before leaving for IPL 2024...Abhishek said, 'You'll be happy after seeing my batting',\" he stated.",
        "urls":"https:\/\/indianexpress.com\/article\/sports\/cricket\/abhishek-sharma-success-ipl-2024-shubman-gill-yuvraj-singh-9355337\/lite\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Gautam Gambhir set to become India head coach: Report",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kolkata Knight Riders mentor Gautam Gambhir is set to become Team India's next head coach, according to reports. A \"very high-profile owner of an IPL franchise, who is very close to BCCI top brass\" allegedly told Cricbuzz that Gambhir's appointment as India coach is a \"done deal and the announcement will come soon\".",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/done-deal-kkr-mentor-gautam-gambhir-set-to-be-indias-next-head-coach-after-ipl-2024-triumph-claims-report?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Australia’s Joe Burns to play for Italy, honouring late brother",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Joe Burns, a former Test hitter for Australia, has announced that he will play for Italy in the qualifiers leading up to the 2026 Men's T20 World Cup. Burns has chosen to pay tribute to his brother, who departed from this life in February of this year. \"85 was his number in the last team he played for\" Burns wrote.",
        "urls":"https:\/\/cricfit.com\/australias-joe-burns-to-play-for-italy-honouring-late-brother-with-jersey-no-85\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Cristiano Ronaldo sets new Saudi Pro League scoring record",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Al Nassr's Cristiano Ronaldo broke the record for most number of goals scored in a Saudi Pro League season. The 39-year-old footballer scored a brace for Al Nassr against Al Ittihad taking his tally to 35 in the season breaking Abderrazak Hamdallah's record of 34 goals in which he scored in the 2018-19 season.",
        "urls":"https:\/\/www.deccanchronicle.com\/sports\/cristiano-ronaldo-sets-new-saudi-pro-league-scoring-record-896110?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Kevin Pietersen clarifies ‘joker’ dig at Ambati Rayudu",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kevin Pietersen has released a statement on his comments about Ambati Rayudu being a joker at a post-match show following Sunday's IPL 2024 final. Pietersen took to X to demand an end to the tribalism directed towards Indian players, stating that Rayudu and he were merely playing about. \"@RayuduAmbati and I were messing around after the IPL final,\" wrote Pietersen.",
        "urls":"https:\/\/cricfit.com\/ambati-rayudu-and-i-were-messing-around-after-the-ipl-final-kevin-pietersen-clarifies-joker-dig-at-ambati-rayudu\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"'Abhishek Nayar deserves all the credit': Venkatesh Iyer",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"In a post-match interview with Harsha Bhogle, following KKR's victory in the 2024 IPL Final, Varun Chakravarthy and Venkatesh Iyer lauded Abhishek Nayar for his crucial role in their success. Amidst the applause and cheers, some players ensured that assistant coach Abhishek Nayar received the recognition he deserved. \"Abhishek Nayar deserves all the credit in the world,\" said Venkatesh Iyer.",
        "urls":"https:\/\/cricfit.com\/abhishek-nayar-deserves-all-the-credit-in-the-world-venkatesh-iyer\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"India to play intra-squad match before the Australia Test series",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Indian Team will play an intra-squad match right before the 5-match Test series against Australia. India would feature against India-A in Perth from 15th-17th November, Cricket Australia announced the schedule on Tuesday. Australia-A will face India-A in 2 first-class matches from 31st October. The final match of the series will be played from 15th to 17th November.",
        "urls":"https:\/\/cricfit.com\/team-india-to-play-intra-squad-match-before-the-australia-test-series\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Kohli didn't win any title, Gambhir & MSD know how to win: Bhatia",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Ex-KKR all-rounder Rajat Bhatia said MS Dhoni and Gautam Gambhir know how to win tournaments. \"Virat Kohli never won any title...as captain. Even Sachin Tendulkar never produced results as captain,\" he added. Talking about Sunil Narine, ex-KKR batter Manvinder Bisla stated, \"The way Narine got run out in KKR's first game against SRH, other franchises except KKR would've dropped him.\"",
        "urls":null
    },
    {
        "category":"sports",
        "titles":"What major records were broken in IPL 2024?",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The highest-ever IPL total was recorded in IPL 2024 season, with SRH scoring 287\/3 against RCB. PBKS recorded the highest-ever IPL chase by chasing down 262-run target against KKR. As many as 549 runs were scored in SRH-RCB match, the highest match aggregate in T20s. Record for most 200+ totals in an IPL season was also broken in 2024 (41).",
        "urls":"https:\/\/www.espncricinfo.com\/series\/indian-premier-league-2024-1410320\/kolkata-knight-riders-vs-sunrisers-hyderabad-final-1426312\/full-scorecard?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"AUS coaches might play in T20 WC warm-ups due to player shortage",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Australia will be short on resources for their 2024 T20 World Cup warm-up matches, with only nine players at their disposal. Pat Cummins, Travis Head and Mitchell Starc, all of whom featured in the 2024 IPL final, have been given a break, among others. The shortage of players means Australia will probably field their coaching staff during the warm-up matches.",
        "urls":"https:\/\/wisden.com\/t20-world-cup-2024-2\/australia-coaches-expected-to-field-in-t20-world-cup-warm-ups-due-to-player-shortage?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"KKR social media admin leaves Narine and Russell in splits",
        "date":"Monday, 27 May, 2024",
        "descriptions":"KKR cricketers Sunil Narine and Andre Russell were stumped as the franchise's social media admin posed a hilarious question in the dressing room after the IPL 2024 final victory on Sunday in Chennai. With the admin asking the question, 'Final match you perform, what's happening?,'the West Indian duo were left in splits.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/final-match-you-perform-what-happening-kkr-social-media-admins-question-stumps-narine-russell-video?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Shreyas Iyer can pip Shubman Gill, become India's captain: Uthappa",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Ex-KKR batter Robin Uthappa said KKR captain Shreyas Iyer can pip players like Shubman Gill and become Team India's captain. \"He has got the character and wherewithal to handle a team...Even after going through a lot...he barely spoke about it,\" he added. \"I think this is just the beginning of the leader that we'll see Shreyas [eventually] become,\" he stated.",
        "urls":"https:\/\/www.hindustantimes.com\/cricket\/shreyas-iyer-next-in-line-to-become-india-captain-ahead-of-shubman-gill-after-ipl-2024-triumph-kkr-legend-101716800649618-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"SRK asks KKR to recreate Harshit Rana’s flying kiss celebration",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Kolkata Knight Riders co-owner Shah Rukh Khan asked his team to recreate Harshit Rana's trademark flying kiss celebration after they beat Sunrisers Hyderabad in the 2024 IPL final. In a viral video, SRK can be heard saying, \"The whole team has to stand with me, and I will say three, two, one and everyone will have to do this.\"",
        "urls":"https:\/\/wisden.com\/ipl-2024-2\/watch-srk-asks-kkr-to-recreate-harshit-ranas-flying-kiss-celebration-after-ipl-2024-win?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Shah Rukh Khan chants 'CSK CSK' with Chennai fans after KKR's IPL 2024 win",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Shah Rukh Khan chanted 'CSK CSK' with Chennai fans after KKR defeated SRH in IPL 2024 final at Chepauk Stadium in Chennai on Sunday. Shah Rukh was doing a victory lap when a section of fans started chanting 'CSK CSK', with Shah Rukh joining them. KKR beat SRH by eight wickets to win their third IPL title.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/video-shahrukh-khan-chants-csk-csk-along-with-fans-after-kkr-win-ipl-2024-final-at-chepauk?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Why will Jos Buttler miss 3rd England vs Pakistan T20I on May 28?",
        "date":"Monday, 27 May, 2024",
        "descriptions":"England captain Jos Buttler will miss the third T20I against Pakistan at the Sophia Gardens in Cardiff. Buttler has left the Three Lions squad ahead of the impending birth of his second child ahead of match three in the four-game series on May 28. Replacing Buttler, vice-captain Moeen Ali will lead the side in the 3rd T20I.",
        "urls":"https:\/\/sportstiger.com\/news\/eng-vs-pak-why-will-jos-buttler-miss-3rd-england-vs-pakistan-t20i-on-may-28?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"'You have made us proud': SRH CEO Kavya Maran after final loss",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Sunrisers Hyderabad CEO Kavya Maran motivated SRH players after their loss in the IPL 2024 final against Kolkata Knight Riders. Despite falling short, SRH broke multiple records, including the highest score in IPL history. KKR co-owner Shah Rukh Khan celebrated their victory with fans and players, creating a memorable conclusion to the season.",
        "urls":"https:\/\/www.thehawk.in\/posts\/%22you-have-made-us-proud%22:-srh-ceo-kavya-maran-tells-players-after-heartbreaking-loss-in-final?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Australia faces shortage of players for warm-up matches at T20 WC",
        "date":"Monday, 27 May, 2024",
        "descriptions":"The Australian cricket is amid some trouble as they are facing an issue to field a proper XI for the T20 World Cup 2024 warm-up matches. The Aussie skipper said, \"We are going undermanned. But it is a practice game. The guys who need to play will play as much as they can and we'll figure it out from there.\"",
        "urls":"https:\/\/www.sportstiger.com\/news\/australia-facing-shortage-of-players-for-t20-world-cup-2024-warm-up-games-confirms-mitchell-marsh?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Kohli must know outside noise made him better in T20s: Manjrekar",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Talking about criticism faced by batter Virat Kohli over his strike rate in T20 cricket, ex-India cricketer Sanjay Manjrekar said Kohli must know the \"outside noise\" has helped him become a better T20 batter. Kohli, referring to his strike rate critics, had said that talking about strike rates from commentary box isn't same as winning matches for team.",
        "urls":"https:\/\/www.sportskeeda.com\/cricket\/news-virat-kohli-t20-player-two-years-ago-sanjay-manjrekar-expects-india-s-experienced-stars-better-t20-world-cup?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Aston Martin and Red Bull set to finalize key deals soon",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ahead of the upcoming Canadian Grand Prix, there is a lot of movement in F1 markets. From drivers to support staff teams are in talks to finalize some deals. Starting with Red Bull Racing Sergio Perez is likely to continue with the team. On the other hand, Aston Martin is also looking for a new Chief Technical Officer (CTO).",
        "urls":"https:\/\/sports.info\/autosport\/aston-martin-and-red-bull-on-the-way-to-finalizing-crucial-deals-ahead-of-the-canadian-gp-4653359?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Riyan Parag trolled over viral YouTube search history leak",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Rajasthan Royals batting star Riyan Parag is being trolled endlessly by netizens after his alleged YouTube search history got leaked with objectionable content. Parag was live streaming his gaming session on YouTube when his drop-down list revealed searches for \"Ananya Panday hot, Sara Ali Khan hot\" videos. The 22-year-old immediately became the butt of all jokes on social media.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/4k-mein-pakdaa-gaya-rr-star-riyan-parag-trolled-endlessly-over-viral-youtube-search-history-leak?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rinku Singh video calls his sister after IPL 2024 final",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kolkata Knight Riders (KKR) batter Rinku Singh was involved in a video call with his family after the IPL 2024 final on Sunday at the MA Chidambaram Stadium in Chennai. In a video surfaced on social media, Rinku's sister was seen congratulating him on winning the tournament as the cricketer's other family members were also present.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/jeet-gaye-aaj-toh-rinku-singh-speaks-to-his-sister-on-video-call-after-ipl-2024-final?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Phil Salt joins KKR’s IPL 2024 title celebrations via video call",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Despite leaving for international duties, Phil Salt joined KKR's IPL 2024 title celebrations via video call, expressing his wishes to his teammates. His departure before the Playoffs, for England's T20I series against Pakistan, didn't deter his spirit. Salt interacted with players and staff, highlighting his integral role in KKR's success, especially his partnership with Sunil Narine.",
        "urls":"https:\/\/www.sportsgaga.com\/phil-salt-joins-kkrs-ipl-2024-title-celebrations-via-video-call\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Belgium announce 25-man squad for UEFA Euro 2024; Courtois dropped",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Belgium announced 25-member squad for UEFA Euro 2024 in Germany on May 28. The squad saw City star Kevin de Bruyne and Jeremy Doku in the team. However, Real Madrid's star goalkeeper Thibaut Courtois' omission left everyone surprised. Belgium have been drawn in Group E alongside Ukraine, Slovakia and Romania.",
        "urls":"https:\/\/www.sportstiger.com\/news\/belgium-announce-25-man-squad-for-uefa-euro-2024-thibaut-courtois-dropped?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Babar Azam unimpressed by fan mob in Cardiff, asks for space",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Pakistan skipper Babar Azam was unimpressed as fans mobbed him for selfies in Cardiff, asking for space in a viral video. The Lahore-born batter, dressed in a white t-shirt and cream trousers, was visibly irked. Meanwhile, Pakistan aims to level the T20I series against England in Cardiff after a loss in Birmingham.",
        "urls":"https:\/\/www.sportsgaga.com\/babar-azam-unimpressed-by-fan-mob-in-cardiff-asks-for-space\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"UEFA Euro 2024: Belgium announce 25-man squad",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ahead of the tournament, Belgium have announced their squad for the Euro. Head coach Domenico Tedesco has left out Thibaut Courtois, as the manager has some issues with the Real Madrid goalkeeper. The latter was upset with the fact that he was not named as the captain, and he made himself unavailable for the tournament, despite being fully fit.",
        "urls":"https:\/\/sports.info\/football\/uefa-euro-2024-thibaut-courtois-misses-out-as-belgium-announce-25-man-squad-4653404?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Watch: Kavya Maran’s talk to SRH post IPL loss wins hearts",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"In a heartfelt attempt to lift the spirits of the Sunrisers Hyderabad (SRH) camp franchise owner, Kavya Maran visited the Orange Army's dressing room to give them a pep talk following their devastating loss in IPL final, which helped to lift morale. \"I'm really proud of all of you. You've really changed the way we play T-20 cricket,\" she said.",
        "urls":"https:\/\/www.shethepeople.tv\/shesport\/kavya-maran-talk-to-players-post-ipl-final-loss-4650941?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Nitish Rana shares special message from Gambhir after IPL 2024 win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Nitish Rana took to Instagram to share a special message he received from Gautam Gambhir. While Nitish Rana had extended a congratulatory message for Gambhir after his appointment as KKR mentor, in return the latter replied, \"Let's create something special. There is no better feeling in sport to stand on a podium and win a trophy. Let's experience that.\"",
        "urls":"https:\/\/www.sportstiger.com\/news\/nitish-rana-shares-special-message-from-gautam-gambhir-after-kkrs-ipl-2024-victory-goes-viral?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Hardik and Natasa have issues with each other, are living separately: Report",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Amid rumours of their divorce, a report has claimed that cricketer Hardik Pandya and model Natasa Stankovic have been living separately for a few months. \"They have issues with each other,\" the report further said while quoting a source. \"Natasa has walked out on Hardik. One doesn't know if they will get back or not...Both are unconventional,\" the report added.",
        "urls":"https:\/\/www.timesnownews.com\/entertainment-news\/bollywood\/hardik-pandya-natasha-stankovic-living-separately-they-are-an-unconventional-couple-says-their-friend-exclusive-article-110485183\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Russell dances with Ananya on 'Lutt Putt Gaya' during party to celebrate IPL win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"KKR all-rounder Andre Russell danced with actress Ananya Panday on Shah Rukh Khan-starrer Dunki song 'Lutt Putt Gaya' during a party to celebrate KKR's IPL title win. A video of the same has been shared widely on social media. KKR head coach Chandrakant Pandit can also be seen dancing in the video.",
        "urls":"https:\/\/www.sportskeeda.com\/cricket\/news-watch-andre-russell-grooves-srk-s-lutt-putt-gaya-song-ananya-pandey-part-kkr-s-ipl-2024-victory-celebrations?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Praggnanandhaa beats Alireza in 38 moves in Norway Chess's Round 1",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India's 18-year-old Chess Grandmaster R Praggnanandhaa beat French chess player Alireza Firouzja, who'd recently beaten Magnus Carlsen, in 38 moves in Norway Chess 2024's opening round. Praggnanandhaa recorded his first ever over-the-board victory over Firouzja in their Armageddon match. Firouzja had recently become the second player to beat Carlsen twice in a Grand Final of Champions Chess Tour.",
        "urls":"https:\/\/www.timesnownews.com\/sports\/chess\/norway-chess-r-praggnanandhaa-defeats-alireza-in-38-moves-in-armageddon-article-110493604\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"There's so much to cherish right now: Shreyas Iyer post-IPL win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"KKR secured their third IPL title in a dominant display, thoroughly outplaying SRH in the final. Team captain Shreyas Iyer was effusive in his praise for his squad, expressing immense pride in their performance. He emphasized that KKR's players executed their roles flawlessly. \"There's so much to cherish right now,\" Iyer remarked in the post-match presentation.",
        "urls":"https:\/\/cricfit.com\/theres-so-much-to-cherish-right-now-shreyas-iyer\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"I'm coming on 28th: Rinku Singh to Rishabh Pant after KKR's win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Rinku Singh excitedly told Rishabh Pant, \"Bhaiyya, I'm coming on 28th\" during a video call after KKR won the IPL 2024 final against SRH on May 26. Although Rinku is not part of the main squad, he is traveling as a reserve player. The conversation was shared on KKR's official social media, showing Pant congratulating Rinku Singh and Nitish Rana.",
        "urls":"https:\/\/cricfit.com\/watch-im-coming-on-28th-rinku-singh-tells-rishabh-pant-after-kkrs-ipl-2024-win\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rinku Singh praises Rohit Sharma’s support post T20 World Cup snub",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India batter Rinku Singh commended Rohit Sharma for his support for young cricketers. According to Singh, Rohit has been incredibly helpful and encouraging to the youth, especially following the T20 World Cup snub. While praising Rohit, Rinku said, \"He supports the youth a lot. He only wants the youth to do well and he always says that play, do well.\"",
        "urls":"https:\/\/cricfit.com\/he-supports-the-youth-a-lot-rinku-singh-praises-rohit-sharmas-support-after-t20-world-cup-snub\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Russell dances to SRK’s song during KKR's victory celebration",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"All-rounder Andre Russell was spotted dancing to the upbeat 'Lutt Putt Gaya' song with Bollywood actor Ananya Panday as part of KKR's celebrations after their 2024 IPL victory. The song features Shah Rukh Khan, who is also the co-owner of the Kolkata franchise. Following KKR's triumph, numerous pictures and videos of victory celebrations have become viral on social media.",
        "urls":"https:\/\/cricfit.com\/watch-andre-russell-dances-to-srks-lutt-putt-gaya-song-with-ananya-panday-during-kkrs-ipl-2024-victory-celebrations\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Eoin Morgan selects the top contenders for the 2024 T20 World Cup",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ex-England Captain Eoin Morgan has chosen India as his top pick to win the forthcoming 2024 T20 World Cup. Morgan believes that the Men in Blue's strength and extensive roster render them the most formidable team in the tournament, even amidst injuries. He expressed this view during a panel conversation on Sky Sports, alongside ex-cricketer Nasser Hussain and Michael Atherton.",
        "urls":"https:\/\/cricfit.com\/eoin-morgan-selects-the-top-contenders-for-the-2024-t20-world-cup\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Gambhir comments during Chandrakant Pandit’s speech post KKR’s win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"KKR defeated the SRH by eight wickets in the IPL 2024 final in Chennai on May 26. After the IPL final, KKR head coach Chandrakant Pandit gave a speech in the dressing room. Gautam Gambhir, the team's mentor, interrupted to suggest that the players were eager to start celebrating. Gambhir was heard saying: \"Ladke paagal hore dance karne ke liye.\"",
        "urls":"https:\/\/cricfit.com\/ladke-paagal-hore-dance-karne-ke-liye-gautam-gambhir-during-chandrakant-pandits-speech-following-kkrs-ipl-2024-final-win\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Pietersen defends Rayudu after 'banter' turns into online abuse",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kevin Pietersen defended Ambati Rayudu after \"banter\" between the two commentators during the IPL 2024 final led to social media abuse towards Rayudu. \"Come on guys! This tribalism with\/against Indian players on social media needs to slow down!\" Pietersen wrote on X (formerly Twitter). \"All of sudden that banter has turned into an avalanche of abuse towards Ambati,\" he added.",
        "urls":"https:\/\/wisden.com\/ipl-2024-2\/kevin-pietersen-defends-ambati-rayudu-banter-snowballs-social-media-abuse?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Monfils runs around court & scores, winks & smiles at opponent",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Gael Monfils ran around court and scored a point in his first-round match against Seyboth Wild in 2024 French Open. After scoring he smiled and winked at his opponent. With the win which was his 122nd career win at a Grand Slam, Monfils broke all-time record for most career wins at a major by a Frenchman, surpassing Jo-Wilfried Tsonga's 121.",
        "urls":"https:\/\/youtu.be\/EBmcdhI0-jM?t=26&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"I would've picked Shubman over Jaiswal: Morgan on T20 WC 2024",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Former England captain Eoin Morgan said he would have picked Shubman Gill over Yashasvi Jaiswal for T20 World Cup 2024. \"It's a big call...but I [consider] Shubman as a future leader,\" he added. Former Team India chief selector Krishnamachari Srikkanth had earlier stated that Rinku Singh should have been picked for T20 World Cup 2024 at Jaiswal's expense if needed.",
        "urls":"https:\/\/www.timesnownews.com\/sports\/cricket\/i-would-have-him-over-yashasvi-jaiswal-eoin-morgan-questions-india-snubbbing-future-leader-shubman-gill-from-t20-wc-squad-article-110474249\/amp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"No team in world has such strong line-up: Afridi on Pak's bowling",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Speaking about Pakistan's bowling ahead of upcoming T20 World Cup, ex-Pakistan captain Shahid Afridi said no team in the world has such a strong line-up. \"All our four fast bowlers have...lot of skill and even the bowlers sitting on...bench like Abbas (Afridi) have a lot of skill,\" he stated. Haris Rauf, Shaheen Afridi, Mohammad Amir are part of squad.",
        "urls":"https:\/\/www.aninews.in\/news\/sports\/cricket\/nobody-has-such-strong-bowling-line-up-shahid-afridi-on-pakistan-speedsters-ahead-of-t20-world-cup20240527233425\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Give him 10 balls & Pandya will give you 30-40 runs: Panesar on WC",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Defending all-rounder Hardik Pandya's selection in India squad for the upcoming T20 World Cup, ex-England cricketer Monty Panesar said if given 10 balls, Pandya can score 30-40 runs. \"His fielding is also electric. He has got...knack of picking up key wickets and is often the golden arm,\" Panesar stated. Pandya has scored 1,348 runs in 92 T20Is so far.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/10-ball-40-man-monty-panesar-backs-impact-player-hardik-pandya-to-fire-in-t20-world-cup-2024?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Mercedes' misstep in aiding Hamilton; Toto Wolff speaks out",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Toto Wolff clarified the 'miscommunication' with Mercedes during Lewis Hamilton's pit stop at the Monaco Grand Prix. Hamilton pitted on Lap 51, aiming to undercut Max Verstappen with fresh Pirelli tyres but failed to do so. While speaking to the media Toto Wolff said, \"It was a miscommunication first between us on the pit wall that we got that wrong.\"",
        "urls":"https:\/\/sports.info\/autosport\/mercedes-team-principal-toto-wolff-opens-up-about-teams-error-to-assist-lewis-hamilton-after-pit-stop-at-monaco-4652123?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Please stop avalanche of abuse towards Rayudu: Pietersen to trolls after 'joker' remark",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ex-England captain Kevin Pietersen took to X to defend Ambati Rayudu after the latter was trolled on social media after Pietersen jokingly called him a \"joker\" for changing his attire after KKR's win. Pietersen stated that he was messing around with Rayudu, adding, \"All of sudden that banter...turned into an avalanche of abuse towards Ambati. PLEASE stop it?\"",
        "urls":"https:\/\/x.com\/KP24\/status\/1795343171834335493?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Shadab is making mistakes, why isn't he following advice: Afridi",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Reacting to Pakistan all-rounder Shadab Khan recording his worst figures in T20Is after conceding 55 runs without a wicket in second T20I against England, ex-Pakistan captain Shahid Afridi said, \"I asked him, 'How're you making such mistakes?'\" \"[Ex-Pakistan spinner] Saeed Ajmal was there with the team. Ajmal should be asked why Shadab isn't doing what he was told,\" he added.",
        "urls":"https:\/\/www.aninews.in\/news\/sports\/cricket\/former-pakistan-captain-shahid-afridi-motivates-shadab-after-latter-registers-worst-t20i-bowling-figures20240527183824\/?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Joe Burns to play for Italy in tribute to late brother Dominic",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Australian cricketer Joe Burns will play for Italy to honor his late brother Dominic, who passed away in February. Burns will wear jersey number 85, Dominic's number and birth year. Eligible through his mother's heritage, Burns joins Italy for the 2026 T20 World Cup qualifiers, scheduled from June 9-16 in Rome.",
        "urls":"https:\/\/www.sportsgaga.com\/australian-cricketer-joe-burns-to-play-for-italy-in-tribute-to-late-brother-dominic\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"India head coach application deadline ends; Gambhir not interested",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The deadline for applying for the Indian men's cricket team head coach position ended on Monday. However, neither the BCCI nor Gautam Gambhir, a top candidate for the job, made any public statements about the situation. VVS Laxman was the BCCI's main choice for the position. However, Laxman is reportedly not interested in taking on a full-time job.",
        "urls":"https:\/\/cricfit.com\/team-india-head-coach-application-deadline-ends-vvs-laxman-gautam-gambhir-not-interested\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Babar Azam scolds fans as they try to take selfies, video viral",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Pakistan white-ball skipper Babar Azam was unimpressed as fans tried to mob him in Cardiff for selfies. In a video that has emerged on social media, the right-handed batter was heard scolding fans and asking them to give him some room instead of mobbing him. Security officials were also present with him.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/upar-nahin-chadho-angry-babar-azam-scolds-fans-who-wanted-selfies-with-pakistan-caption-in-cardiff-video?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"I couldn't even brush my teeth for 2-3 months after accident: Rishabh Pant",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Wicketkeeper-batter Rishabh Pant has revealed that he couldn't brush his teeth for two to three months after his car accident on December 30, 2022. He further said that for six to seven months, he suffered unbearable pain. Pant stated, \"I couldn't go to the airport because I was nervous about facing people in a wheelchair.\"",
        "urls":"https:\/\/www.crictracker.com\/cricket-news\/i-couldnt-even-brush-my-teeth-for-two-months-rishabh-pant-on-his-traumatic-experience-post-horrific-accident\/?amp=1&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Kevin Pietersen urges IPL fans to stop 'abusing' Ambati Rayudu",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ever since RCB exited the IPL 2024 after losing Eliminator against RR, CSK fans and former batter Ambati Rayudu criticised Bengaluru and Virat Kohli. After involving in the IPL 2024 final post-match banter with fellow commentators Kevin Pietersen and Mayanti Langer, fans hurled abuses at the 38-year-old, which forced the England international to urge fans to stop mistreating Rayudu.",
        "urls":"https:\/\/www.sportstiger.com\/news\/please-stop-it-kevin-pietersen-urges-ipl-fans-to-stop-abuse-towards-ambati-rayudu?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Jiaana Garg, 5, becomes youngest girl with FIDE Chess rating",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Jiaana Garg, a 5-year-old chess star from Chandigarh, got her International Chess Federation (FIDE) rating of 1558 on May 1, 2024. She is the only female player in the world to get a rating at this young age. The little girl was inspired by her gold-winning chess player brother and started professional training in Chandigarh when she was 4.",
        "urls":"https:\/\/www.shethepeople.tv\/shesport\/jiaana-garg-youngest-fide-rated-female-chess-player-4650708?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Pakistan's Umar Akmal wishes 'KKL' on winning IPL, gets trolled",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Pakistani cricketer Umar Akmal, while wishing KKR on winning IPL 2024, mistakenly wrote KKL instead of KKR in his post. \"At least he wrote congratulations correctly,\" an X user commented. Another wrote, \"Congratulations KKL on winning IPR.\" Another comment read, \"Congratulations to IPL for winning third KKR.\"",
        "urls":"https:\/\/www.news18.com\/amp\/cricket\/pakistan-cricketer-sparks-hilarious-reactions-after-wishing-kkr-for-winning-ipl-2024-8906712.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"BCCI receives over 3,000 fake applications for Head Coach: Reports",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"With deadline date of Team India's Head Coach role closing, reports reveal that BCCI has received over 3000 fake applications in the name of former cricketers and politicians like Dhoni and PM Modi. \"Last year too, BCCI received such a response where impostors applied and the story is similar this time,\" a BCCI source was quoted by The Indian Express.",
        "urls":"https:\/\/www.sportstiger.com\/news\/from-narendra-modi-to-ms-dhoni-bcci-receive-over-3000-fake-applications-for-team-indias-head-coach-role-reports?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"George & I will go for a run as Monaco race was boring: Verstappen",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Speaking to the media after the conclusion of 2024 Monaco GP race, Red Bull driver Max Verstappen said, \"I think [Mercedes driver] George Russell and I, we are going to go for a run now.\" \"Because we did not really have an exercise. My god that was terrible, so boring,\" Verstappen stated. Verstappen and Russell finished sixth and fifth respectively.",
        "urls":"https:\/\/www.sportskeeda.com\/f1\/news-my-god-terrible-boring-max-verstappen-george-russell-s-hilarious-banter-f1-monaco-gp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Leclerc pushes Ferrari principal Vasseur in water post Monaco win",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ferrari driver Charles Leclerc pushed team principal Frederic Vasseur into the harbour after winning 2024 F1 Monaco GP. After pushing Vasseur, Leclerc himself dived into water to celebrate his win. Leclerc has won his home race at Monaco for the first time in his F1 career. McLaren and Ferrari drivers Oscar Piastri and Carlos Sainz finished second and third respectively.",
        "urls":"https:\/\/www.sportskeeda.com\/f1\/news-watch-charles-leclerc-flings-ferrari-team-principal-fred-vasseur-harbor-winning-f1-monaco-gp?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Pietersen urges trolls to stop abusing Rayudu after 'joker' remark",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Former England captain and middle-order batter Kevin Pietersen has issued a statement over calling Ambati Rayudu a joker during a post-match show in the IPL 2024 final on Sunday between the Kolkata Knight Riders and SunRisers Hyderabad. Pietersen took to X and called for tribalism against Indian players to stop as he and Rayudu were only involved in a banter.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/please-stop-abusing-ambati-rayudu-kevin-pietersen-to-trolls-on-his-viral-joker-remark-during-ipl-final?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Nadal exits Roland Garros in first round after hinting retirement",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"It was an emotional evening at Court Philippe-Chatrier as the 'King of Clay' Rafael Nadal made a shocking first-round exit in Roland Garros 2024 on Monday. Even as Alexander Zverev claimed a straight sets victory, hearts went out to Nadal, who might as well, played his last match of the Grand Slam ever.",
        "urls":"https:\/\/www.sportstiger.com\/news\/it-was-special-king-of-clay-rafael-nadal-after-potential-last-roland-garros-appearance?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Jaylen Brown wins 2024 East Finals MVP as Celtics sweep Pacers",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The Boston Celtics swept the Indiana Pacers 4-0 in the 2024 NBA Eastern Conference Finals with a 105-102 win in Game 4 on Monday night. Jaylen Brown, who scored a game-high 29 points against the Pacers in Game 4, was surprised to win the Larry Bird Eastern Conference Finals MVP and gave a hilarious reaction in the post-game press conference.",
        "urls":"https:\/\/www.sportstiger.com\/news\/i-never-win-st-jaylen-brown-on-winning-2024-eastern-conference-finals-mvp-as-celtics-sweep-pacers?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Don't look sad: SRH owner Kaviya Maran in dressing room speech to players",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"SRH have shared a video showing their owner Kaviya Maran giving a speech to the players in the dressing room after their IPL 2024 final loss to KKR. In the video, Kaviya can be heard telling players to not look sad. \"You redefined the way we play T20 cricket and everyone is talking about us,\" she said.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=Xm102DE-XLk&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Tendulkar, Dhoni, PM Modi among names used by fake applicants for India head coach job",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The BCCI has received more than 3,000 applicants for the post of India head coach, however, most of them are from fake names including former cricketers and politicians, The Indian Express reported. PM Narendra Modi, Amit Shah, Sachin Tendulkar, MS Dhoni are some of the names used by fake applicants. The deadline for applying for the post ended on Monday.",
        "urls":null
    },
    {
        "category":"sports",
        "titles":"Modi, Shah among names used by applicants for Team India coach job",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The BCCI received over 3,000 applications for the India head coach position, with many fake entries under names like Narendra Modi, Amit Shah, and Sachin Tendulkar. Posted on May 13 via Google Forms, the job listing closed on May 27. The BCCI now faces the challenge of sorting genuine applications from fake ones, a recurring issue from previous years.",
        "urls":"https:\/\/www.breezyscroll.com\/sports\/bcci-receives-3000-applications-for-india-head-coach-job-modi-amit-shah-and-sachin-tendulkar-among-fake-applicants\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Chris Gayle attends Monaco Grand Prix 2024 with Mbappe and others",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"West Indies cricket legend Chris Gayle made waves at the Monaco Grand Prix 2024, sharing moments on social media. He posted photos with Kylian Mbappe, FIFA's Gianni Infantino, rugby stars Siya Kolisi and Tendai Mtawarira, and DJ Diplo. Captioning \"Greatness within... Legends Never Die...\" Gayle's presence added cricketing charm to the star-studded F1 event.",
        "urls":"https:\/\/www.sportsgaga.com\/monaco-meet-up-chris-gayles-celeb-filled-day-at-the-grand-prix\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"CR7 becomes first ever league's top scorer in four countries",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Cristiano Ronaldo established a new goal-scoring record after his last night's heroics against Al-Ittihad in the Saudi Pro League. The 39-year-old record breaker scored a brace on Monday to become the all-time top scorer in a single Saudi Pro League season. Ronaldo also becomes the first player to win a top scorer of the season award in four different leagues.",
        "urls":"https:\/\/www.sportstiger.com\/news\/the-records-follow-me-cristiano-ronaldo-after-breaking-saudi-pro-league-season-goal-scoring-record?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"'Ladke pagal hore dance karne ke liye' says Gambhir during KKR coach's speech",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"After KKR won IPL 2024, a video showing head coach Chandrakant Pandit giving a speech in dressing room emerged online. During the speech, mentor Gautam Gambhir interrupted Pandit and told him players were getting impatient to dance. \"Ladke paagal hore dance karne ke liye,\" he was heard saying. Reacting to it, a fan wrote, \"He never seemed so happy before.\"",
        "urls":"https:\/\/www.sportskeeda.com\/cricket\/news-watch-ladke-paagal-hore-dance-karne-ke-liye-gautam-gambhir-chandrakant-pandit-s-speech-kkr-s-ipl-2024-final-win?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Bangladesh Cricket unveils new jersey for ICC Men’s T20 WC 2024",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Bangladesh Cricket revealed their ICC Men's T20 World Cup 2024 jersey on social media, flaunting dark green as primary and bold red as secondary colors. The 15-man squad showcased the attire, gearing up with a balanced squad for Group D battles against South Africa and Sri Lanka in the tournament.",
        "urls":"https:\/\/www.sportsgaga.com\/bangladesh-cricket-unveils-new-jersey-for-icc-mens-t20-world-cup-2024\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Nadal's playful moment with his son after French Open game",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Tennis legend Rafael Nadal enjoyed a playful moment with his son after a stunning first-round exit from the 2024 edition of French Open in Paris. In a video shared by Roland Garros' official social media handle, Nadal was seen adorably playing with his son off the court as his family was present for the occasion.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/video-rafael-nadal-shares-playful-moment-with-his-son-after-stunning-first-round-exit-in-french-open-2024?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"How long will Alpha Academy bear with Chad Gable?",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Otis nearly got a belt treatment from Chad Gable on Monday Night Raw. The likes of Maxxine Dupri and Sami Zayn stopped Gable from smashing Otis by a belt. After Bronson Reed beat Otis, Gable asked Otis to hold the rope and took his belt out to smash the Alpha Academy member, which was not good to see.",
        "urls":"https:\/\/sports.info\/wwe\/how-long-will-otis-and-alpha-academy-obey-their-master-coach-perc-chad-gable-4650225?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Watch: KKR players groove to ‘Desi Boyz’ after IPL 2024 victory",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"KKR assistant coach Abhishek Nayar, along with Varun Chakravarthy and Ramandeep Singh, celebrated the team's IPL 2024 final win by dancing joyfully. Kolkata's comprehensive victory over SRH led to jubilant celebrations, with the trio seen grooving to 'Desi Boyz' at the after-party. The one-sided match saw Hyderabad bundled out for 113, allowing Kolkata to chase down the target swiftly.",
        "urls":"https:\/\/www.sportsgaga.com\/watch-kkrs-abhishek-nayar-players-groove-to-desi-boyz-after-ipl-2024-victory\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"You don't want hard yards but you see Kohli & want to copy: Jacks",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Talking about Virat Kohli, RCB batter Will Jacks said he is a \"very good role model\". He stated that Kohli's intensity and everything he \"does is a 100 percent attention\". \"As a young guy who often doesn't want to do the hard yards, but you see Kohli doing it and want to copy that,\" Jacks added.",
        "urls":"https:\/\/www.hindustantimes.com\/cricket\/rcb-will-jacks-wants-to-copy-virat-kohli-you-see-him-doing-that-101716872126786-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Orton best performer in 30 yrs, Michaels not even close: Bischoff",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Eric Bischoff said World Wrestling Entertainment (WWE) wrestler Randy Orton has been the best wrestler in last 30 years and is better than Shawn Michaels. \"And, in my opinion, subjective as it may be, not even close,\" he stated. Orton is a 14-time World Champion in WWE. Only John Cena and Ric Flair have won more world titles than Orton.",
        "urls":"https:\/\/www.sportskeeda.com\/wwe\/news-current-wwe-star-better-shawn-michaels-eric-bischoff-says?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts#:~:text=Shawn%20Michaels%20is%20viewed%20by,in%20Saudi%20Arabia%20on%20Saturday."
    },
    {
        "category":"sports",
        "titles":"Chahal, Avesh and Yashasvi head to New York for ICC T20 WC 2024",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"India cricketers Yuzvendra Chahal, Avesh Khan and Yashasvi Jaiswal are heading to New York for the ICC T20 World Cup 2024, starting on June 2. Fresh from their IPL stint with Rajasthan Royals, they will join the Indian contingent in the US. Chahal shared an airport photo on Instagram, captioned, \"National duty ON.\"",
        "urls":"https:\/\/www.sportsgaga.com\/india-cricketers-chahal-avesh-and-jaiswal-head-to-new-york-for-the-icc-t20-wc-2024\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"SRH Owner Kavya delivers emotional speech after IPL final loss",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Sunrisers Hyderabad (SRH) owner Kavya Maran delivered an emotional speech after her team's 8-wicket defeat to Kolkata Knight Riders (KKR) in the 2024 IPL final. SRH's poor batting led to their lowest final score ever. Maran praised the team's effort, acknowledging their impact on T20 cricket.",
        "urls":"https:\/\/www.sportsgaga.com\/srh-owner-kavya-maran-delivers-emotional-speech-after-ipl-final-loss\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Cristiano Ronaldo sets another unique record after scoring brace",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Cristiano Ronaldo is the first player to score 35 goals in a season, breaking the previous record of Abderrazak Hamdallah who previously scored 34 in the 2018\/19 season. He becomes the first player to ever become the top scorer in four different leagues, (Spain, England, Italy, and Saudi Arabia).",
        "urls":"https:\/\/sports.info\/football\/cristiano-ronaldo-sets-another-unique-record-after-scoring-brace-against-al-ittihad-4650380?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Strongest side even with injuries is India: Morgan on 2024 T20 WC",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Former England captain Eoin Morgan picked India as his favourite to win the 2024 T20 World Cup, which will be held in West Indies and the USA from June 1. \"For me, the strongest side even with injuries throughout the tournament is India,\" he said. Morgan added the Rohit Sharma-led side has the quality to beat anybody in the tournament.",
        "urls":"https:\/\/www.sportskeeda.com\/cricket\/news-the-strongest-side-even-injuries-throughout-tournament-india-eoin-morgan-picks-2024-t20-world-cup-favorites?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Big percentage that I'll not return for next French Open: Nadal",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Speaking after his loss against Alexander Zverev in first round of 2024 French Open, Rafael Nadal said there is a big percentage that he will not return next year in the tournament. \"I don't know if it's gonna be the last time here in front of all of you. But if it's the last time, I enjoyed it,\" he stated.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=dF2KM7d_3EU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"India at T20 World Cup: Schedule, squad, match timings and more",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The ninth edition of the ICC Men's T20 World Cup will begin on June 1, with the West Indies and the USA set to co-host the marquee event. Placed in Group A, India will begin their campaign against Ireland on June 5, at the Nassau County International Cricket Stadium, New York, followed by the clash against Pakistan on June 9.",
        "urls":"https:\/\/www.ndtvprofit.com\/sports\/india-at-t20-world-cup-2024-schedule-squad-match-timings-and-more?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Braun Strowman takes out Judgement Day after beating JD McDonagh",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Braun Strowman answered the entire Judgement Day with his might. The monster beat JD McDonagh and was attacked by Finn Balor and Carlito. Strowman chased all of them and looked for JD throughout the night. The former world champion singlehandedly countered the Judgement Day members with his might.",
        "urls":"https:\/\/sports.info\/wwe\/braun-strowman-takes-out-judgement-day-after-beating-jd-mcdonagh-4649946?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Bron Breakker spears Ilja Dragunov and Ricochet on Raw",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Bron Breakker speared both Ricochet and Ilja Dragunov on Raw. The aggressive wrestler interrupted the match between Ricochet and Ilja despite being suspended. As Adam Pearce stopped him from doing further damage and asked for the motive, the former NXT Star ignored the Raw General Manager.",
        "urls":"https:\/\/sports.info\/wwe\/bron-breakker-spears-ilja-dragunov-and-ricochet-despite-suspension-4649982?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Big percentage that I'll not return for next French Open: Nadal",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Speaking after his loss against Alexander Zverev in first round of 2024 French Open, Rafael Nadal said there is a big percentage that he will not return next year in the tournament. \"I don't know if it's gonna be the last time here in front of all of you. But if it's the last time, I enjoyed it,\" he stated.",
        "urls":"https:\/\/www.youtube.com\/watch?utm_campaign=fullarticle&v=dF2KM7d_3EU&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Becky Lynch to face Liv Morgan in steel cage match on Raw",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Becky Lynch is set to take on Liv Morgan in the steel cage match in the main event of Monday Night Raw. The Man will be hoping to win the Women's World Championship which she lost in the Queen of the Ring. The official announcement for it came from WWE through their post on social media handles.",
        "urls":"https:\/\/sports.info\/wwe\/rematch-on-raw-as-liv-morgan-set-to-defend-her-world-title-against-becky-lynch-in-steel-cage-match-4649922?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Brawl breaks out between Sheamus and Ludwig Kaiser on Raw",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"A brawl broke out between Ludwig Kaiser and Sheamus on Monday Night Raw. The Celtic Warrior held Kaiser responsible for his loss in round one of King of the Ring against Gunther. As Ludwig nullified allegations against him, the former world champion went backstage and attacked the Imperium member.",
        "urls":"https:\/\/sports.info\/wwe\/brawl-breaks-out-between-sheamus-and-ludwig-kaiser-on-red-brand-4650026?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Jaylen Brown named as MVP of the Eastern Conference Final",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"After Boston Celtics defeated Indiana Pacers on Monday night, Jaylen Brown was chosen the MVP of the Eastern Conference Finals and went on to earn the coveted Larry Bird Trophy. Boston advanced to the NBA Finals as Jaylen Brown scored 29 points in the game against Indiana Pacers. Jayson Tatum won the first East Finals MVP award in 2022.",
        "urls":"https:\/\/sports.info\/basketball\/jaylen-brown-wins-the-larry-bird-eastern-conference-finals-mvp-award-4650244?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rinku shares exciting moment with Rishabh Pant after IPL victory",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"After KKR's IPL 2024 victory, Rinku Singh shared a joyful chat with India's Rishabh Pant, captured in a video shared by KKR. Singh, in high spirits post-match, received congratulations from Pant, adding to the celebration. Singh, part of India's T20 World Cup 2024 reserve players, will join the squad in the USA despite being left out of the main squad.",
        "urls":"https:\/\/www.sportsgaga.com\/rinku-singh-shares-exciting-moment-with-rishabh-pant-after-ipl-victory\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Boston Celtics beat Indiana Pacers",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Boston Celtics recovered from an 89-82 fourth-quarter gap to defeat the Pacers 105-102 on Monday night, marking their second comeback in two games in Indianapolis. Jaylen Brown scored 29 points as Boston Celtics won the Eastern Conference finals 4-0 and will go to the NBA Finals. Boston will face Dallas Mavericks or Minnesota Timberwolves in the NBA Final.",
        "urls":"https:\/\/sports.info\/basketball\/lets-goooooo-fans-react-as-boston-celtics-beat-indiana-pacers-to-reach-nba-finals-4650119?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Netizens troll Umar Akmal for misspelling KKR as KKL",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Ex-Pakistan middle-order batter Umar Akmal has been trolled on X after he posted a congratulatory message for the Kolkata Knight Riders (KKR) for winning IPL 2024 final. The veteran batter took to X and wrote KKL instead of KKR in his congratulatory message for the franchise, prompting the netizens to take a jibe at him.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/phir-nasha-karke-bol-raha-hai-netizens-troll-umar-akmal-as-he-misspells-kkr-as-kkl-on-x?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Andre lights up IPL victory party with 'Lutt Putt Gaya' dance",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"West Indies' Andre Russell celebrated Kolkata Knight Riders' IPL 2024 win with a dance to Shah Rukh Khan's 'Lutt Putt Gaya' alongside actress Ananya Pandey. KKR, led by Shreyas Iyer, secured their third title by comfortably defeating Sunrisers Hyderabad. Russell's three wickets helped bundle SRH for 113. A viral video captured the vibrant celebration, resonating widely on social media.",
        "urls":"https:\/\/www.sportsgaga.com\/andre-russell-lights-up-ipl-victory-party-with-lutt-putt-gaya-groove\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Things got better in IPL since wife Alyssa Healy turned up: Starc",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"KKR pacer Mitchell Starc, who conceded 100 runs and hadn't taken any wicket after first two games in IPL 2024, said things got better after his wife Alyssa Healy joined him in the tournament. Starc, who became the most expensive buy ever after KKR bought him for ₹24.75 crore, picked 17 wickets in the tournament.",
        "urls":"https:\/\/www.crictracker.com\/cricket-news\/everythings-better-since-alyssa-has-turned-up-mitchell-starc-credits-wife-for-change-in-fortunes-at-ipl-2024-8209\/?amp=1&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Team India arrives in New York for T20 World Cup 2024",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The first batch of India's T20 World Cup squad landed in New York for the tournament set in the West Indies and USA on June 2. Led by Rohit Sharma, players Jasprit Bumrah and Rishabh Pant flew from Mumbai. BCCI shared videos capturing their journey and arrival. Virat Kohli and other members of the squad will join them later.",
        "urls":"https:\/\/www.sportsgaga.com\/team-india-arrives-in-new-york-for-t20-world-cup-2024\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"KKR skipper Shreyas Iyer spotted at Mumbai airport, watch video",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Kolkata Knight Riders' latest title-winning captain Shreyas Iyer landed in Mumbai on late Monday evening from Chennai, having led the franchise to an emphatic win in the IPL 2024 final on Sunday. In a video that surfaced on social media, the right-handed batter was seen walking through T2 of the Mumbai airport.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/video-kkr-captain-shreyas-iyer-spotted-at-mumbai-airport-clicks-selfies-with-fans?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Can't credit 1 guy, things changed after Gambhir came: Rinku",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Speaking after winning IPL 2024 final against SRH, KKR batter Rinku Singh said the credit for the performance of the team cannot be given to one person and everyone worked hard. \"Since Gautam Gambhir (KKR mentor) came, a lot of things have changed. Sending Sunil Narine early, he batted so well,\" he stated. KKR won IPL for the third time.",
        "urls":null
    },
    {
        "category":"sports",
        "titles":"Harsha Bhogle names his Team of IPL 2024",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Commentator Harsha Bhogle has named his Team of IPL 2024, including Virat Kohli and Sunil Narine as openers. He further included Sanju Samson, Riyan Parag, Nicholas Pooran, Andre Russell, Dinesh Karthik, Jasprit Bumrah, Varun Chakaravarthy, Trent Boult and T Natarajan. Kohli was the Orange Cap winner at IPL 2024, while Narine was named MVP.",
        "urls":"https:\/\/www.crictracker.com\/cricket-news\/ipl-2024-harsha-bhogle-picks-team-of-the-tournament\/"
    },
    {
        "category":"sports",
        "titles":"India players were not in IPL final, won't be tired in WC: Akram",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Reacting to no Team India players, who are in squad for upcoming T20 World Cup, being in IPL final, ex-Pakistan captain Wasim Akram said, \"At least none of them will have to say...they are tired.\" \"They were thinking ahead,\" he stated. KKR batter Rinku Singh, who played IPL final, has been named as a reserve for the World Cup.",
        "urls":"https:\/\/www.hindustantimes.com\/cricket\/at-least-now-they-wont-say-theyre-tired-wasim-akram-gets-cheeky-as-none-of-indias-t20-world-cup-15-makes-ipl-final-101716808265239-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"I tell players 'play however you want, but make Gautam dance': SRK",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"After KKR lifted the IPL 2024 trophy, co-owner Shah Rukh Khan shared what he says whenever he attends team meetings. He said, \"We have a rule: whenever I go to...meetings, the discussion is always that everyone will play however they want...but this time let's make Gautam (Gambhir) dance.\" \"For...Gambhir to come back and achieve this is outstanding,\" added Shah Rukh.",
        "urls":null
    },
    {
        "category":"sports",
        "titles":"Tyrese Haliburton not available for Game 4",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"Tyrese Haliburton, a two-time All-Star, will miss Game 4 against Boston on Monday night due to an injured left hamstring. The All-NBA star will miss his second consecutive game in the Eastern Conference playoffs. While the Pacers twice established 18-point leads against Boston without Haliburton in Game 3, Boston Celtics still defeated the Pacers 114-111.",
        "urls":"https:\/\/sports.info\/basketball\/tyrese-haliburton-misses-game-4-against-boston-celtics-due-to-injury-4650032?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Bill Walton passes away due to cancer",
        "date":"Tuesday, 28 May, 2024",
        "descriptions":"The NBA reported today that Bill Walton, a former NBA standout and Hall of Famer, died at the age of 71. The league reported that Walton died surrounded by his loved ones following a \"prolonged\" battle with cancer. He won two championships as a player and was named the NBA's MVP in the 1977\/1978 season.",
        "urls":"https:\/\/sports.info\/basketball\/legendary-basketball-player-bill-walton-passes-away-at-71-4649954?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"PV Sindhu and HS Prannoy lead Indian charge at Singapore Open",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Top Indian shuttlers, including PV Sindhu, HS Prannoy, and Lakshya Sen, are set to showcase their skills at the USD 850,000 Singapore Open, starting Tuesday. This tournament will be crucial for the athletes to fine-tune their preparations for the Paris Olympics, which are just two months away. PV Sindhu will face Line Hojmark Kjaersfeldt in her opening match.",
        "urls":"https:\/\/thebridge.in\/badminton\/pv-sindhu-hs-prannoy-india-singapore-open-47504?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"French Open: Khachanov eliminates Sumit Nagal in the first round",
        "date":"Monday, 27 May, 2024",
        "descriptions":"India's top singles player, Sumit Nagal, faced a tough challenge in his French Open debut, succumbing to Russia's Karen Khachanov in straight sets. The match concluded with Nagal losing 2-6, 0-6, 6-7(5) on Monday. Ranked 95th, Nagal struggled to counter the powerful and consistent play of Khachanov.",
        "urls":"https:\/\/thebridge.in\/tennis\/french-open-khachanov-eliminates-sumit-nagal-47503?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rinku Singh video calls Rishabh Pant after IPL 2024 final",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Kolkata Knight Riders' (KKR) cricketers Rinku Singh and Nitish Rana were seen video calling Rishabh Pant, who is in USA, following their IPL 2024 final victory on Sunday in Chennai. With Rinku Singh selected in the reserves for T20 World Cup 2024, the left-handed batter was heard telling Pant that he is coming on 28th to USA.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/bhaiyya-im-coming-28th-rinku-singh-tells-rishabh-pant-on-video-call-after-kkr-win-ipl-2024-final?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rinku Singh sings SRK’s movie song after KKR win IPL 2024 title",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Following an epic win in the final of the IPL 2024 against SRH, the KKR players celebrated their triumph in style at the MA Chidambaram Stadium. In the post-match show, when Suresh Raina asked Rinku Singh to sing a movie song of Shah Rukh Khan, he obliged with “Kiska hai ye tumko intezar…” from Main Hoon Na.",
        "urls":"https:\/\/www.sportstiger.com\/news\/kiska-hai-ye-tumko-intezar-rinku-singh-sings-srks-movie-song-after-kkr-win-ipl-2024-title-video-goes-viral?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Hardik Pandya vacations abroad without wife Natasa: Reports",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Hardik Pandya, the Indian vice-captain for the T20 World Cup 2024, is reportedly on a vacation abroad without his wife Natasa Stankovic amidst their divorce rumours. The 30-year-old also missed the US flight with his teammates to be a part of the T20WC, but he is expected to join them in New York before the first practice session begins.",
        "urls":"https:\/\/www.sportstiger.com\/news\/amidst-divorce-rumours-hardik-pandya-vacations-abroad-without-wife-natasa-stankovic-reports?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Riyan Parag seen searching 'Ananya Pandey Hot' on YouTube",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Riyan Parag has sparked a controversy on social media after his alleged YouTube search history leak showed terms like 'Ananya Pandey hot' and 'Sara Ali Khan hot', among others. The suspected leak happened just a few days after Riyan Parag played for RR in Qualifier 2 of the IPL 2024, which they lost to SRH at the MA Chidambaram Stadium.",
        "urls":"https:\/\/sportstiger.com\/news\/riyan-parag-seen-searching-ananya-pandey-hot-on-youtube-goes-viral?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Many people tell me in lifts 'Ask MSD to bat as an opener': Hussey",
        "date":"Monday, 27 May, 2024",
        "descriptions":"CSK batting coach Michael Hussey said many people tell him to ask MS Dhoni to bat as an opener or at number three position while travelling in lifts. \"I get that all the time,\" he added. \"There's been no one better in being able to come in and hitting the ball so cleanly from ball one than Dhoni,\" he stated.",
        "urls":"https:\/\/youtu.be\/3BEec0wmqSI?t=209&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Doull spurred Kohli on, you don't want to see that side: Karthik",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Dinesh Karthik said people like ex-New Zealand cricketer Simon Doull spurred Virat Kohli on with their remarks about his strike-rate in IPL 2024. \"You don't want to see that side of Kohli. He loves proving people wrong...He's like molten lava,\" he added. Discussing the way Kohli pushes fielders, Karthik stated, \"There'll be many bleeps if you...have mic in those timeouts.\"",
        "urls":"https:\/\/www.sportskeeda.com\/cricket\/news-they-just-really-spurred-on-dinesh-karthik-opens-virat-kohli-s-strike-rate-chatter-ipl-2024?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Russ tried to show Undertaker he was taller, got canned: Bassman",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Former wrestling manager Rick Bassman termed former WWE developmental talent Russ McCullough as a \"total sociopath\". \"Russ walked up to The Undertaker, if you could picture this, stood next to him and then stood up on his toes to show Undertaker he was taller than him. Oops. That got him canned pretty fast,\" he stated.",
        "urls":"https:\/\/www.sportskeeda.com\/wwe\/news-the-undertaker-incident-led-ex-talent-s-wwe-exit-rick-bassman-says?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Robinson bowls an over of off-spin in County C'ship bore draw",
        "date":"Monday, 27 May, 2024",
        "descriptions":"England seamer Ollie Robinson delivered an over of off-spin in the dying embers of Sussex's high-scoring draw against Middlesex at Lord's. This is not the first time Robinson has bowled off-spin in a professional match. He famously bowled a short spell of off-spin on England's previous Ashes tour Down Under",
        "urls":"https:\/\/wisden.com\/stories\/county-cricket\/county-championship-2024\/watch-ollie-robinson-delivers-an-over-of-off-spin-in-the-dying-embers-of-county-championship-bore-draw?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Zverev knocks out Nadal from possible last French Open",
        "date":"Monday, 27 May, 2024",
        "descriptions":"German tennis star Alexander Zverev knocked out Rafael Nadal from possibly the last French Open as he registered a straight sets win at the Philippe-Chatrier. Nadal earlier in 2024 openly spoke about possibly retiring from tennis after a few injury-riddled seasons. Nadal suffered a 6-3, 7-6, 6-3 defeat which has now perhaps ended a glorious chapter in his career",
        "urls":"https:\/\/sportstiger.com\/news\/alexander-zverev-knocks-out-rafael-nadal-from-possible-last-french-open?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rafael Nadal knocked out of opening round of French Open 2024",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Fourteen-time French Open winner Rafael Nadal lost in the opening round to be knocked out of the 2024 edition of the Roland Garros. German tennis star Alexander Zverev inflicted a crushing loss on the veteran to send him packing out of the competition. It also proved to be Nadal's first-ever opening-round loss in French Open's history.",
        "urls":"https:\/\/www.freepressjournal.in\/sports\/french-open-2024-14-time-champion-rafael-nadal-knocked-out-of-opening-round-by-alexander-zverev?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Rafael Nadal crashes out of French Open in 1st round for the first time ever",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Fourteen-time champion Rafael Nadal crashed out of French Open in the first round for the first time ever. The 37-year-old lost to Alexander Zverev 3-6, 6-7(5-7), 3-6 in three hours and five minutes in the first round of Roland Garros 2024. Nadal had won the French Open in 2022 and had withdrawn from the tournament in 2023 due to injury.",
        "urls":"https:\/\/x.com\/rolandgarros\/status\/1795129528383136047?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Yuvraj Singh offered poor quality apartment in Delhi by builder; sends legal notices",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Former India cricketer Yuvraj Singh has sent two separate legal notices to two Delhi-based real estate firms, alleging violation of his privacy rights in promotion of construction projects and for delayed delivery of possession. He also accused them of offering him an \"extremely inferior quality\" apartment. Yuvraj had booked a dwelling unit in 2020 at Delhi's Hauz Khas.",
        "urls":"https:\/\/repository.inshorts.com\/articles\/en\/PTI\/c3db4f65-71c0-4dd7-b2d0-5ca564e77f1b?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Hollow, strange; sets bad precedent: McGregor on Paul facing Tyson",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Irish MMA fighter Conor McGregor termed American YouTuber Jake Paul's upcoming fight against American boxer Mike Tyson as \"hollow\" and \"strange\". \"It does set a bad precedent...The interest is low and I don't know, I don't understand it,\" he stated. \"Doing these little smash-and-grab fights, you might get a few likes, but there is nothing substantial to it,\" he said.",
        "urls":"https:\/\/www.pinkvilla.com\/sports\/hes-very-articulate-about-fighting-dana-white-compares-conor-mcgregor-and-mike-tysons-fighter-iq-1309907?amp=&utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Iyer recreates Messi's iconic FIFA World Cup-winning dance after lifting IPL trophy",
        "date":"Monday, 27 May, 2024",
        "descriptions":"KKR captain Shreyas Iyer recreated Lionel Messi's iconic FIFA World Cup-winning dance after lifting IPL 2024 trophy on Sunday. Iyer walked towards his teammates after collecting the trophy the same way Messi did after winning FIFA World Cup in 2022 after beating France. KKR won the IPL for the third time, winning IPL 2024 final by eight wickets.",
        "urls":"https:\/\/www.hindustantimes.com\/cricket\/shreyas-iyer-recreates-lionel-messi-iconic-fifa-world-cup-winning-celebration-after-lifting-ipl-trophy-for-kkr-101716775627699-amp.html?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts"
    },
    {
        "category":"sports",
        "titles":"Final match you perform what happening: KKR recreate viral video",
        "date":"Monday, 27 May, 2024",
        "descriptions":"KKR shared an uproarious video with West Indian stars Sunil Narine and Andre Russell after winning IPL 2024. In a clip for social media, the interviewer asked the pair, \"Final match you perform what happening.\" For the uninitiated, this exact question was asked to Narine and Russell after their BPL 2023 triumph which went instantly viral.",
        "urls":"https:\/\/sportstiger.com\/news\/final-match-you-perform-what-happening-kkr-recreate-viral-interview-with-narine-and-russell?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    },
    {
        "category":"sports",
        "titles":"Nadal rejects farewell ceremony at French Open",
        "date":"Monday, 27 May, 2024",
        "descriptions":"Rafael Nadal, nearing the end of his illustrious career, declined a farewell ceremony at the French Open, keeping the door open for a potential return. Tournament director Amélie Mauresmo revealed Nadal's desire to possibly play next year. Despite ongoing injury struggles and speculation about his final appearance, Nadal remains uncertain about retiring.",
        "urls":"https:\/\/www.breezyscroll.com\/sports\/breezy-explainer-why-french-open-organizers-canceled-farewell-ceremony-for-rafael-nadal\/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle"
    }
]